<?php

// Heading
$_['heading_title'] = '<img width="24" height="24" src="view/image/neoseo.png" style="float: left;"><span style="margin:0;line-height 24px;">NeoSeo Мульти Экспорт</span>';
$_['heading_title_raw'] = 'NeoSeo Мульти Экспорт';

//Tab
$_['tab_general'] = 'Общие';
$_['tab_feeds'] = 'Экспорты';
$_['tab_formats'] = 'Форматы';
$_['tab_fields'] = 'Поля';
$_['tab_logs'] = 'Логи';
$_['tab_license'] = 'Лицензия';
$_['tab_support'] = 'Поддержка';

//Button
$_['button_clear_log'] = 'Очистить лог';
$_['button_save'] = 'Сохранить';
$_['button_save_and_close'] = 'Сохранить и Закрыть';
$_['button_close'] = 'Закрыть';
$_['button_recheck'] = 'Перепроверить';
$_['button_download_log'] = 'Скачать файл логов';

// Text
$_['text_module_version'] = '';
$_['text_module'] = 'Модули';
$_['text_success'] = 'Настройки модуля обновлены!';
$_['text_success_delete'] = 'Запись экспорта успешно удалена!';
$_['text_success_delete_format'] = 'Запись формата успешно удалена!';
$_['text_success_clear'] = 'Лог файл успешно очищен!';
$_['text_new_feed'] = 'Новый экспорт';
$_['text_del_feed'] = 'Удалить экспорт';
$_['button_clear_log'] = 'Очистить лог';
$_['text_feed'] = 'Каналы продвижения';
$_['text_success_options'] = 'Настройки модуля обновлены!';
$_['text_success'] = 'Настройки модуля обновлены!';
$_['text_select_all'] = 'Выделить всё';
$_['text_unselect_all'] = 'Снять выделение';
$_['text_bigmir'] = 'bigmir';
$_['text_hotline'] = 'hotline.ua';
$_['text_prom'] = 'prom.ua';
$_['text_yml'] = 'YML';
$_['text_custom'] = 'Зарезервировано';
$_['text_google'] = 'google merchant';
$_['text_link'] = 'По запросу';
$_['text_cron'] = 'По расписанию';
$_['text_description'] = '<p>Описание</p>';
$_['text_list'] = 'Список экспортов';
$_['text_list_format'] = 'Список форматов';
$_['text_edit'] = 'Редактирование экспорта';
$_['text_add'] = 'Добавление экспорта';
$_['text_edit_format'] = 'Редактирование формата';
$_['text_add_format'] = 'Добавление формата';
$_['text_none'] = 'Встроенные';

// Entry
$_['entry_status'] = 'Статус';
$_['entry_id_format'] = 'Формат';
$_['entry_format'] = 'Формат';
$_['entry_debug'] = 'Отладка';
$_['entry_type'] = 'Формирование экспорта';
$_['entry_cron'] = 'CRON';
$_['entry_field_list_name'] = 'Переменная шаблона';
$_['entry_field_list_desc'] = 'Описание';
$_['entry_feed_format_name'] = 'Формат';
$_['entry_format_xml'] = 'XML код';
$_['entry_feed_name'] = 'Экспорт';
$_['entry_feed_name_desc'] = 'Название экспорта, будет отображаться во вкладке экспортов';
$_['entry_feed_shortname'] = '<label class="control-label">Название файла</label><br>Будет отображаться в урле, по которому будет доступен экспорт';
$_['entry_feed_status'] = 'Статус экспорта';
$_['entry_feed_status_desc'] = 'Отключение будет блокировать экспорт как по запросу, так и по расписанию';
$_['entry_data_feed'] = 'Адрес';
$_['entry_shopname'] = 'Название магазина';
$_['entry_shopname_desc'] = 'Короткое название магазина (название, которое выводится в списке найденных товаров. Не должно содержать более 20 символов)';
$_['entry_company'] = 'Компания';
$_['entry_company_desc'] = 'Полное наименование компании, владеющей магазином. Не публикуется, используется для внутренней идентификации';
$_['entry_categories'] = '<label class="control-label">Категории</label><br>Отметьте категории из которых надо экспортировать предложения';
$_['entry_manufacturers'] = '<label class="control-label">Производители</label><br>Отметьте производителей из которых надо экспортировать предложения';
$_['entry_currency'] = '<label class="control-label">Валюта предложений</label><br>Пересчет будет выполнен по курсу, заданному в админке';
$_['entry_out_of_stock'] = 'Статус &quot;Нет в наличии&quot;';
$_['entry_out_of_stock_desc'] = 'Прайс агрегаторы требуют чтобы им выгружался только товар в наличии. И для этой цели мы отсеиваем товары, которые выключены или у которых нулевой остаток. Но иногда нулевой остаток не показатель, а реальным показателем является статус товара. В данном поле вы указываете значение этого статуса, чтобы мы понимали что если остаток 0 и статус товара вот такой как тут указан, то товара нет с вероятностью 146%';
$_['entry_ip_list'] = '<label class="control-label">Список доверенных ip-адресов</label><br>Укажите свой личный айпи и айпи сервера прайс-агрегатора, чтобы больше никто не имел доступ к вашим товарам';
$_['entry_image_width'] = '<label class="control-label">Ширина картинки товара</label><br>Измеряется в пикселях, рекомендуемое значение - 600';
$_['entry_image_height'] = '<label class="control-label">Высота картинки товара</label><br>Измеряется в пикселях, рекомендуемое значение - 600';
$_['entry_pictures_limit'] = '<label class="control-label">Макс. кол-во картинок</label><br>Чаще всего агрегаторы принимают не более 10 картинок на товар. Укажите тут ограничение чтобы прайс агрегатор не сыпал ошибками';
$_['entry_delivery_status'] = 'Доставка';
$_['entry_delivery_status_desc'] = 'Включите, если есть ваш магазин осуществляет доставку';
$_['entry_pickup_status'] = 'Самовывоз';
$_['entry_pickup_status_desc'] = 'Включите, если у вас есть точки самовывоза';
$_['entry_store_status'] = 'Магазин';
$_['entry_store_status_desc'] = 'Включите, если у вас есть оффлайн магазины';
$_['entry_language_id'] = '<label class="control-label">Язык экспорта</label><br>Укажите язык описаний товаров и категорий';
$_['entry_feed_demand'] = 'Ссылка';
$_['entry_feed_cron'] = 'Ссылка';
$_['entry_product_id'] = 'Откуда брать код продукта';
$_['entry_product_id_desc'] = 'По умолчанию - product_id.';
$_['entry_product_name'] = 'Откуда брать название продукта';
$_['entry_product_name_desc'] = 'По умолчанию - name.';
$_['entry_product_desc'] = 'Откуда брать описание продукта';
$_['entry_product_desc_desc'] = 'По умолчанию - description.';
$_['entry_product_vendor'] = 'Откуда брать код производителя';
$_['entry_product_vendor_desc'] = 'По умолчанию - sku.';
$_['entry_attribute_status'] = 'Выгружать атрибуты';
$_['entry_option_status'] = 'Выгружать с учетом опций';
$_['entry_generate'] = 'Генерация кеша изображений';
$_['entry_generate_desc'] = 'Можно ускорить формирование выгрузки если заранее сформировать все кеши изображений';
$_['entry_feed_action'] = 'Действие';
$_['entry_use_original_images'] = '<label class="control-label">Использовать оригиналы изображений</label>';
$_['entry_sql_code'] = '<label class="control-label">SQL для тонкой настройки</label><br>Укажите любое SQL выражение с использованием префикса p.<br> "Например p.price > 100 или p.price > 100 and p.quantity > 0"';
$_['entry_use_main_category'] = '<label class="control-label">Использовать главную категорию</label>';
$_['entry_use_main_category_desc'] = 'Использовать поле "Главная категория", а не "Показывать в категориях"';
$_['entry_use_categories'] = '<label class="control-label">Используемые категории</label>';
$_['entry_sql_code_before'] = '<label class="control-label">SQL для подготовки данных</label><br>Укажите серию SQL запросов, которые будут выполнены перед формированием данных. Все запросы необходимо разделять точкой с запятой  - ";"';
$_['entry_store'] = 'Магазини';
$_['entry_use_warehouse_quantity'] = 'Использовать количество товара по складам';
$_['entry_warehouse'] = '<label class="control-label">Склады</label><br>Отметьте склады из которых надо брать остаток предложения. Если выбранно несколько складов, остаток будет суммироваться.';

//Success
$_['success_update_product_feed_categories'] = 'Связи товаров с категориями мультиэкспорта обновлены!';

// Error
$_['error_permission'] = 'У Вас нет прав для управления модулем NeoSeo Мульти Экспорт!';
$_['error_download_logs'] = 'Файл логов пустой или отсутствует!';
$_['error_ioncube_missing'] = '';
$_['error_license_missing'] = '';

//fields_desc
$_['field_desc_date'] = 'Дата экспорта. По умолчанию текущая дата';
$_['field_desc_url'] = 'URL адрес по которому доступен экспорт';
$_['field_desc_currency'] = 'Валюта предложений (устанавливается на вкладке экспорты)';
$_['field_desc_categories'] = 'Массив категорий экспорта';
$_['field_desc_category'] = 'Массив категории экспорта';
$_['field_desc_category.id'] = 'Идентификатор категории';
$_['field_desc_category.parentId'] = 'Инентификатор родительской категории';
$_['field_desc_category.name'] = 'Название категории';
$_['field_desc_offers'] = 'Массив товаров экспорта';
$_['field_desc_offer'] = 'Массив товара экспорта';
$_['field_desc_offer.id'] = 'Идентификатор экспорта';
$_['field_desc_offer.url'] = 'URL адрес товара';
$_['field_desc_offer.price'] = 'Цена товара';
$_['offer.currencyId'] = 'Валюта товара (устанавливается на вкладке экспорты)';
$_['offer.categoryId'] = 'Идентификатор категории товара';
$_['offer.name'] = 'Наименование товара';
$_['offer.description'] = 'Описание товара';
$_['offer.model'] = 'Модель товара';
$_['offer.vendor'] = 'Продавец товара';
$_['offer.vendorCode'] = 'Код продавца';
$_['offer.image'] = 'Массив ссылок на изображения товара';
$_['image'] = 'Ссылка на изображение товара';
$_['offer.options'] = 'Массив опций товаров';
$_['option'] = 'Массив опции товара';
$_['option.name'] = 'Наименование опции товара';
$_['option.value'] = 'Значение опции товара';
$_['option.available'] = 'Наличие товара';
$_['offer.attributes'] = 'Массив атрибутов товаров';
$_['attribute'] = 'Массив атрибута товара';
$_['attributes.name'] = 'Наименование атрибута';
$_['attributes.value'] = 'Значение атрибута';

$_['mail_support'] = '';
$_['module_licence'] = '';

$_['text_module_version']='59';
$_['error_license_missing']='<h3 style = "color: red"> Відсутній файл з ключем! </h3>

<p> Для отримання файлу з ключем зв`яжіться з NeoSeo по email <a href="mailto:license@neoseo.com.ua"> license@neoseo.com.ua </a>, при цьому вкажіть: </p>
<ul>
	<li> назву сайту, на якому ви купили модуль, наприклад, https://neoseo.com.ua </li>
	<li> назву модуля, який ви купили, наприклад: NeoSeo Обмін з 1С:Підприємство </li>
	<li> ваше ім`я користувача (нік-нейм) на цьому сайті, наприклад, NeoSeo </li>
	<li> номер замовлення на цьому сайті, наприклад, 355446 </li>
	<li> основний домен сайту для якого буде активований файл з ключем, наприклад, https://neoseo.ua </li>
</ul>

<p> Отриманий файл з ключем покладіть у корінь сайту, тобто поруч з файлом robots.txt і натисніть кнопку "Перевірити ще раз".</p>';
$_['error_ioncube_missing']='<h3 style="color: red">Відсутній IonCube Loader!</h3>

<p>Щоб користуватися нашим модулем, вам потрібно встановити IonCube Loader.</p>

<p>Для установки зверніться до ТП Вашого хостингу</p>

<p>Якщо ви не можете встановити IonCube Loader самостійно, у вас є можливість попросити допомоги у наших фахівців за адресою <a href="mailto:support@neoseo.com.ua"> support@neoseo.com.ua </a></p>';
$_['module_licence']='<h2>Ліцензійні умови згоди на використання програмного забезпечення NeoSeo</h2>
<p>Дякуємо вам за покупку програмних продуктів нашої веб-студії.</p>
<p>Нижче наведені юридичні умови, які поширюються на всіх, хто відвідує наш сайт і користується нашими програмними продуктами або послугами. Дані умови спрямовані на те, щоб захистити ваші інтереси та інтереси ТОВ "НЕОСЕО" і його афілійованих структур і осіб (далі, "ми", "NeoSeo"), які виступають в договорах від його імені.</p>
<p><strong>1. Введення</strong></p>
<p>Ці Умови використання NeoSeo ( "Умови використання") поряд з додатковими умовами, які стосуються ряду конкретних послуг або програмних продуктів, розробок і представлені на веб-сайті (-ів) NeoSeo, містять умови і положення, дія яких поширюється на кожного відвідувача або користувача ( "Користувач", "ви" або "Покупець") веб-сайту NeoSeo, додатків, доповнень і компонентів, запропонованих нами поряд з наданням послуг і веб-сайту, якщо не вказано інше (всі послуги та програмне забезпечення, програмні модулі запропоновані через веб-сайт NeoSeo або допоміжні сервіси, веб-сервіси, ін. додатки від імені NeoSeo спільно іменуються - "Послуги NeoSeo" або "Послуги").</p>
<p>Умови NeoSeo є обов`язковим контрактом між NeoSeo і вами - тому просимо вас уважно ознайомитися з ними.</p>
<p>Ви можете відвідувати і / або використовувати Послуги NeoSeo тільки в тому випадку, якщо повністю згодні з Умовами NeoSeo: використовуючи будь-яку з Послуг NeoSeo і / або підписуючись на неї, ви висловлюєте і підтверджуєте свою згоду з даними Умовами користування та іншими Умовами NeoSeo, наприклад, умови надання послуг програмування в розрізі типових і нетипових завдань, які виписані тут:   <a href="https://neoseo.com.ua/vse-chto-nujno-znat-klienty" target="_blank" class="external">https://neoseo.com.ua/vse-chto-nujno-znat-klienty</a> , (далі Умови NeoSeo).</p>
<p>Якщо ви не можете прочитати Умови NeoSeo, не знаєте їх або не згодні з ними, ви повинні покинути Веб-сайт NeoSeo і не користуватися Послугами NeoSeo.</p>
<p>Використовуючи наші Програмні продукти, Сервіси і Послуги, ви підтверджуєте, що ознайомилися з нашою Політикою конфіденційності, доступною до перегляду за адресою <a href="https://neoseo.com.ua/politika-konfidencialnosti" target="_blank" class="external">https://neoseo.com.ua/politika-konfidencialnosti</a>   ("Політика конфіденційності").</p>
<p>Цей документ є ліцензійною угодою між вами і NeoSeo.</p>
<p>Погоджуючись на цю угоду або використовуючи програмне забезпечення, ви погоджуєтеся з усіма цими умовами.</p>
<p>Ця угода відноситься до програмного забезпечення NeoSeo, будь-яких шрифтів, піктограм, зображень або звукових файлів, що надаються у складі програмного забезпечення, а також до всіх оновлень, доповнень або служб NeoSeo для програмного забезпечення, якщо в їх відношенні не застосовуються інші умови. Це також стосується розроблених в NeoSeo додатків і доповнень для SEO-Магазину, які забезпечують розширення його функціональних можливостей.</p>
<p>До використання вами деяких функцій додатків можуть застосовуватися додаткові умови NeoSeo і третіх осіб. Для коректної роботи деяких додатків необхідні додаткові угоди з окремими умовами та політиками конфіденційності, наприклад з сервісами, які надають послуги смс-нотифікації.</p>
<p>Програмне забезпечення не продається, а надається за ліцензією.</p>
<p>NeoSeo зберігає за собою всі права (наприклад, права, передбачені законами про захист інтелектуальної власності), які не надаються явно в рамках цієї угоди. Наприклад, ця ліцензія не надає вам права:</p>
<li><span></span><span></span>окремо використовувати або віртуалізувати компоненти програмного забезпечення;</li>
<li>публікувати або копіювати (за винятком дозволеної резервної копії) програмне забезпечення, надавати програмне забезпечення у прокат, в оренду або в тимчасове користування;</li>
<li>передавати програмне забезпечення (за винятком випадків, передбачених цією угодою);</li>
<li>намагатися обійти технічні обмеження програмного продукту;</li>
<li>вивчати технологію, декомпілювати або деасемблувати програмне забезпечення, а також вживати відповідні спроби, крім тих що в мірі та у випадках, коли це (а) передбачено відповідним правом; (б) дозволено умовами ліцензії на використання компонентів з відкритим вихідним кодом, які можуть входити до складу цього програмного забезпечення; (c) необхідно для налагодження змін будь-яких бібліотек, що ліцензуються по малій стандартній громадській ліцензії GNU, які входять до складу програмного забезпечення та пов`язані з ним;</li>
<p>Ви маєте право використовувати дане програмне забезпечення, тільки якщо у вас є відповідна ліцензія і програмне забезпечення було належним чином активовано з використанням справжнього ключа продукту або в інший дозволений спосіб.</p>
<p>У вартість ліцензії SEO-Магазину не включені послуги установки, настройки і тим більше його стилізації, також як і інші платні / безкоштовні доповнення до нього. Дані послуги є додатковими, вартість залежить від кількості необхідних для реалізації годин, детальніше тут: <a href="https://neoseo.com.ua/vse-chto-nujno-znat-klienty" target="_blank" class="external">https://neoseo.com.ua/vse-chto-nujno-znat-klienty</a></p>
<p>З повною версією документа можна ознайомитися тут:</p>
<p><a href="https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya" target="_blank" class="external">https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya</a>
</p>';
$_['mail_support']='<h2>Умови безкоштовної та платної інформаційної та технічної підтримки в <a class="external" href="https://neoseo.com.ua/" target="_blank">NeoSeo</a>.</h2>

<p>Оскільки ми впевнені у тому, що будь-яка Якісна робота повинна бути оплачуваною, всі консультаційні відповіді, що вимагають попередньої підготовки - платні, в т.ч. і ситуації у стилі: &quot;подивіться, а чому тут ВАШ модуль не працює?&quot;</p>

<p>Якщо відповідь на Ваше питання у нас вже готова, Ви її отримаєте безкоштовно. Але якщо для відповіді потрібно витратити час, щоб розібратися в питанні, вивчити файли, знайти помилку і проаналізувати, перш ніж отримати відповідь, попросимо здійснити оплату.</p>

<p>Ми допомагаємо безкоштовно <strong>по встановленні</strong> і <strong>усуненні помилок при встановленні</strong> куплених у нас модулів у порядку загальної черги.</p>

<p>За будь-якими питаннями звертайтесь на support@neoseo.com.ua.</p>

<p>З повною версією ліцензійної угоди ознайомтесь тут: <a class="external" href="https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya" target="_blank">https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya</a></p>

<p><strong>Бонус за написання відгуку!</strong></p>

<p>Шановний покупець, для того щоб наші програмні продукти ставали ще кращими і ти отримував ще більше, залиш, будь ласка, відгук про наш продукт або співпрацю з нами на нашій сторінці Facebook, Google, Яндекс і OpenCartForum.com.</p>

<p>- пиши як є, нам важливо почути чесну і об&#39;єктивну оцінку нашої роботи.</p>

<p>Посилання на наші модулі та профілі:</p>

<ul>
    <li>Профіль компанії на Opencartforum <a class="external" href="https://opencartforum.com/topic/41195-neoseo/?page=5" target="_blank">https://opencartforum.com/topic/41195-neoseo/?page=5</a></li>
    <li><a class="external" href="https://www.facebook.com/neoseo.com.ua/" target="_blank">Facebook</a> клікніть тут: <a class="external" href="http://prntscr.com/g67dtz" target="_blank">http://prntscr.com/g67dtz</a></li>
    <li><a class="external" href="https://goo.gl/N6t2xw" target="_blank">Google</a>, зробіть клік ось тут: <a class="external" href="http://prntscr.com/g3se6f" target="_blank">http://prntscr.com/g3se6f</a></li>
    <li><a class="external" href="https://yandex.ru/maps/org/neoseo/1835577365/" target="_blank">Профіль компанії на Яндекс</a> (відгук повинен пройти модерацію сервісу)</li>
</ul>

<p>У знак подяки за витрачений час на написання відгуків, ми підготували для вас бонус:</p>

<ol>
    <li>за написання відгуку на будь-яких двох майданчиках: знижка - 50% на будь-який модуль.</li>
    <li>за написання відгуку на 4-х майданчиках - даруємо будь-який потрібний тобі модуль, крім модуля обміну з 1С: Підприємство в подарунок!</li>
</ol>

<p>Повний список можливих функціональних рішень (модулів) знаходиться тут: <b>&nbsp;<a href="https://neoseo.com.ua/module-prices-in-rubles" target="_blank">https://neoseo.com.ua/module-prices-in-rubles</a>&nbsp;</b></p>

<p>Ще раз, велике спасибі за те, що ви з нами!</p>

<p>Команда NeoSeo</p>';
