<?php
// Heading
$_['heading_title']      		 = 'Поставщики';

// Text
$_['text_success']          	 = 'Список постовщиков обновлен!';
$_['text_list']          		 = 'Список';
$_['text_add']          		 = 'Добавление';
$_['text_edit']          		 = 'Редактирование';
// Column
$_['column_name']          		 = 'Поставщик';
$_['column_sort_order']          = 'Порядок сортировки';
$_['column_action']          	 = 'Действие';

// Entry
$_['entry_name']          		 = 'Поставщик';
$_['entry_sort_order']           = 'Порядок сортировки:';
// Error
$_['error_permission']           = 'У вас нет прав для изменения!';
$_['error_name']          		 = 'Название должно быть от 3 до 64 символов!';
$_['error_product']          	 = 'Этот поставщик не может быть удален, поскольку в настоящее время он прикреплен к %s товару(ам)!';
