<?php
// Heading
$_['heading_title']				= '<b>Google Analytics <a href="https://tramplin-studio.store/" target="blank">by Tramplin Studio</a></b>';

// Buttons
$_['button_save']				= 'Зберегти';
$_['button_cancel']				= 'Скасувати';
$_['button_add']				= 'Додати';
$_['button_edit']				= 'Редагувати';
$_['button_remove']				= 'Видалити';

// Tabs
$_['tab_main_settings']			= 'Основні налаштування';
$_['tab_userParams']			= 'Параметри відвідувачів';
$_['tab_ecommerce']				= 'Електронна комерція';
$_['tab_goals']					= 'Цілі';
$_['tab_help']					= 'Допомога!';

// Entry
$_['entry_status']						= 'Статус';
$_['entry_counter']['counter_id']		= 'Ідентифікатор ресурсу';
$_['entry_counter']['type']				= 'Тип лічильника';
$_['entry_counter']['mode']				= 'Режим роботи лічильника';
$_['entry_counter']['pageview']			= 'Відстежувати перегляди сторінок';
$_['entry_counter']['pageview_path']	= 'Передавати шлях сторінки';
$_['entry_counter']['pageview_title']	= 'Передавати заголовок сторінки';
$_['entry_counter']['pageview_location']= 'Передавати повний шлях сторінки';
$_['entry_counter']['timing']			= 'Відстежувати швидкість завантаження сторінки';
$_['entry_counter']['timing_name']		= 'Назва';
$_['entry_counter']['timing_category']	= 'Категорія';
$_['entry_counter']['timing_label']		= 'Ярлик';
$_['entry_counter']['link_attr']		= 'Покращена атрибуція силок';
$_['entry_counter']['link_attr_name']	= 'Назва cookie (префікс)';
$_['entry_counter']['link_attr_expires']= 'Термін дії cookie (секунди)';
$_['entry_counter']['linker']			= 'Міждоменне відстеження';
$_['entry_counter']['linker_domains']	= 'Зв`язуэмі домени';
$_['entry_counter']['linker_domain']	= 'Домен (приклад: example.com)';
$_['entry_counter']['linker_incoming']	= 'Отримання параметрів зв`язування';
$_['entry_counter']['ad_features']		= 'Функції для рекламодавців';
$_['entry_counter']['currency']			= 'Основна валюта';
$_['entry_counter']['country']			= 'Основна країна';
$_['entry_counter']['cookie_name']		= 'Назва cookie (префікс)';
$_['entry_counter']['cookie_domain']	= 'Конфігурація домена cookie';
$_['entry_counter']['cookie_expires']	= 'Термін дії cookie (секунди)';
$_['entry_counter']['cookie_update']	= 'Оновлення cookie';
$_['entry_userParams']['status']		= 'Передавати параметри відвідувачів';
$_['entry_userParams']['userId']		= 'Ідентифікатор відвідувача';
$_['entry_userParams']['type']			= 'Передавати тип відвідувача';
$_['entry_userParams']['group']			= 'Передавати групу відвідувача';
$_['entry_userParams']['date_added']	= 'Передавати дату реєстрації';
$_['entry_userParams']['safe']			= 'Передавати статус безпеки';
$_['entry_userParams']['newsletter']	= 'Передавати статус підписки на розсилку';
$_['entry_userParams']['country']		= 'Передавати країну';
$_['entry_userParams']['zone']			= 'Передавати регіон/область';
$_['entry_userParams']['city']			= 'Передавати місто';
$_['entry_userParams']['postcode']		= 'Передавати поштовий індекс';
$_['entry_userParams']['custom_field']	= 'Передавати довільні поля';
$_['entry_ecommerce']['status']			= 'Передавати дані eCommerce';
$_['entry_ecommerce']['view']			= 'При перегляді товару в списках';
$_['entry_ecommerce']['click']			= 'При натисканні на товар';
$_['entry_ecommerce']['detail']			= 'При перегляді товару';
$_['entry_ecommerce']['add']			= 'При додаванні в кошик';
$_['entry_ecommerce']['remove']			= 'При видаленні з кошика';
$_['entry_ecommerce']['checkout']		= 'При переході до оформлення замовлення';
$_['entry_ecommerce']['purchase']		= 'Після оформленні замовлення';
$_['entry_ecommerce']['brand']			= 'Передавати виробника';
$_['entry_ecommerce']['category']		= 'Передавати категорії';
$_['entry_ecommerce']['list_name']		= 'Передавати список з товарами';
$_['entry_ecommerce']['position']		= 'Передавати позицію товару в списку';
$_['entry_ecommerce']['price']			= 'Передавати ціну';
$_['entry_ecommerce']['quantity']		= 'Передавати кількість';
$_['entry_ecommerce']['variant']		= 'Передавати різновид (опції)';
$_['entry_ecommerce']['affiliation']	= 'Передавати назву магазину';
$_['entry_ecommerce']['revenue']		= 'Передавати дохід';
$_['entry_ecommerce']['revenue_codes']	= 'Враховувати при розрахунку доходу';
$_['entry_ecommerce']['revenue_tax']	= 'Враховувати витрати';
$_['entry_ecommerce']['tax']			= 'Передавати податкове вирахування';
$_['entry_ecommerce']['shipping']		= 'Передавати вартість доставки';
$_['entry_ecommerce']['coupon']			= 'Передавати промокод';
$_['entry_goal']['status']				= 'Передавати дані про досягнуті цілі';
$_['entry_goal']['label']				= 'Ярлик цілі';
$_['entry_goal']['category']			= 'Категорія цілі';
$_['entry_goal']['action']				= 'Дія цілі';
$_['entry_goal']['element']				= 'Елемент';
$_['entry_goal']['event']				= 'Подія';
$_['entry_goal']['value']				= 'Цінність';

// Help
$_['help_counter']['counter_id']		= 'Скопіюйте ідентифікатор ресурсу (номер лічильника) в налаштуваннях на сайті Google Analytics.';
$_['help_counter']['type']				= 'Тип застосовуваного скрипта JS для передачі даних в Google Analytics.';
$_['help_counter']['mode']				= 'Різні методи подгрузки JS. Для асинхронного режиму застосовується метод передачі даних `Beacon`.';
$_['help_counter']['pageview']			= 'Відстеження переглядів і передача додаткових параметрів сторінок.';
$_['help_counter']['pageview_path']		= 'URL сторінки, що переглядається, починатися з символу косої риски (/).';
$_['help_counter']['pageview_title']	= 'Заголовок сторінки, що переглядається.';
$_['help_counter']['pageview_location']	= 'Повний URL сторінки, що переглядається.';
$_['help_counter']['timing']			= 'Відстеження часу користувача. Дозволяє скоротити час завантаження сторінок і поліпшити загальне враження від сайту.';
$_['help_counter']['timing_name']		= 'Рядок, який використовується для ідентифікації переданої змінної. Приклад: `load`.';
$_['help_counter']['timing_category']	= 'Рядок, який використовується для розбиття всіх змінних часу користувача на логічні групи. Приклад: `JS Dependencies`.';
$_['help_counter']['timing_label']		= 'Рядок, який може використовуватися для більш гнучкою візуалізації часу в звітах. Приклад: `Google CDN`.';
$_['help_counter']['link_attr']			= 'Підвищує точність відстеження кліків, автоматично розрізняючи кліки по силкам з одним і тим же URL на одній сторінці.';
$_['help_counter']['link_attr_name']	= 'Для розпізнавання силок використовується файл cookie.';
$_['help_counter']['link_attr_expires']	= 'Максимальна тривалість зберігання файлу cookie (в секундах).';
$_['help_counter']['linker']			= 'Функція зв`язування доменів, яка дозволяє реєструвати відвідування декількох ресурсів як один сеанс.';
$_['help_counter']['linker_domains']	= 'Список цільових доменів для зв`язування. Одне поле - один домен.';
$_['help_counter']['linker_incoming']	= 'Отримання налаштувань зв`язування від цільових доменів.';
$_['help_counter']['ad_features']		= 'Дозволяє вимкнути всі функції для рекламодавців, ремаркетингу та звітів про рекламу.';
$_['help_counter']['currency']			= 'Передача основної валюти інтернет-магазину.';
$_['help_counter']['country']			= 'Передача основної країни діяльності інтернет-магазину.';
$_['help_counter']['cookie_name']		= 'Щоб уникнути конфліктів з іншими файлами cookie, може знадобитися змінити префікс файлу cookie.';
$_['help_counter']['cookie_domain']		= 'Файл cookie може бути записаний в різні рівні домену. Наприклад, якщо сайт знаходиться за адресою `shop.example.com`, файл cookie можна записати в домен `example.com`.';
$_['help_counter']['cookie_expires']	= 'Термін дії файлу cookie оновлюється при кожному завантаженні сторінки: до поточного часу додається значення цього поля. Якщо вказати значення `0`, термін дії файлу cookie закінчиться із завершенням поточного сеансу браузера.';
$_['help_counter']['cookie_update']		= 'Якщо активно, то файли cookie будуть оновлюватися при кожному завантаженні сторінки, а термін дії файлу cookie буде встановлено по самому останньому відвідування сайту. Якщо не активно, то файли cookie НЕ будуть оновлюватися при кожному завантаженні сторінки, а термін дії файлу cookie буде встановлено по першого відвідування сайту користувачем.';
$_['help_userParams']['status']			= 'Ідентифікація відвідувачів сайту і передача довільних параметрів.';
$_['help_userParams']['userId']			= 'Параметр `userId`. Унікальне значення.';
$_['help_userParams']['type']			= 'Параметр `type`. Значення `Guest` або` Registered`.';
$_['help_userParams']['group']			= 'Параметр `group`. Значення відповідає назві налаштованих груп покупців. Тільки для зареєстрованих користувачів!';
$_['help_userParams']['date_added']		= 'Параметр `date_added`. Значення в форматі 0000-00-00. Тільки для зареєстрованих користувачів!';
$_['help_userParams']['safe']			= 'Параметр безпеки аккаунта `safe`. Значення `true` або `false`. Тільки для зареєстрованих користувачів!';
$_['help_userParams']['newsletter']		= 'Параметр `newsletter`. Значення `true` або `false`. Тільки для зареєстрованих користувачів!';
$_['help_userParams']['country']		= 'Параметр `country`. Значення відповідає країні зазначеної в настройках адреси. Тільки для зареєстрованих користувачів!';
$_['help_userParams']['zone']			= 'Параметр `zone`. Значення відповідає регіону вказаному в налаштуваннях адреси. Тільки для зареєстрованих користувачів!';
$_['help_userParams']['city']			= 'Параметр `city`. Значення відповідає місту вказаному в налаштуваннях адреси. Тільки для зареєстрованих користувачів!';
$_['help_userParams']['postcode']		= 'Параметр `postcode`. Значення відповідає індексу вказаному в налаштуваннях адреси. Тільки для зареєстрованих користувачів!';
$_['help_userParams']['custom_field']	= 'Параметр відповідає назві довільних полей на латиниці. Значення відповідають вказаним в настройках аккаунта. Тільки для зареєстрованих користувачів!';
$_['help_ecommerce']['status']			= 'Збір і аналіз даних, що відносяться до галузі електронної комерції - Ecommerce.';
$_['help_ecommerce']['view']			= 'Передача даних відбувається при перегляді товару в списках: категорія, пошук, виробник, акції, модулі з товарами та інші..';
$_['help_ecommerce']['click']			= 'Передача даних відбувається при натисканні на товар.';
$_['help_ecommerce']['detail']			= 'Передача даних відбувається при перегляді картки товару.';
$_['help_ecommerce']['add']				= 'Передача даних відбувається при додаванні товару в кошик.';
$_['help_ecommerce']['remove']			= 'Передача даних відбувається при видаленні товару з кошика.';
$_['help_ecommerce']['checkout']		= 'Передача даних відбувається при переході до оформлення покупки.';
$_['help_ecommerce']['purchase']		= 'Передача даних відбувається після успішного завершення покупки.';
$_['help_ecommerce']['brand']			= 'Назва виробника зазначеного в налаштуваннях товару.';
$_['help_ecommerce']['category']		= 'Повна вітка категорій, наприклад: `категорія 1 / категорія 2`. Передається тільки при перегляді картки товару.';
$_['help_ecommerce']['list_name']		= 'Список в якому знаходився товар при дії `натискання на товар`. Наприклад: категорія, пошук, виробник, акції, модулі з товарами та інші..';
$_['help_ecommerce']['position']		= 'Порядок сортування зазначений в настройках товару, якщо значення не дорівнює 0.';
$_['help_ecommerce']['price']			= 'Ціна товару, включаючи податкову ставку.';
$_['help_ecommerce']['quantity']		= 'Кількість товару на складі, кількість при додаванні або видаленні в кошику, або кількість в скоєному замовленні.';
$_['help_ecommerce']['variant']			= 'Перерахування обраних опцій товару через кому. Передає у всіх випадках, крім перегляду картки товару.';
$_['help_ecommerce']['affiliation']		= 'Передача назви магазину зазначеної в налаштуваннях системи OpenCart.';
$_['help_ecommerce']['revenue']			= 'Розрахунок і передача доходу від кожного вчиненого замовлення.';
$_['help_ecommerce']['revenue_codes']	= 'Вкажіть надбавки які слід враховувати при розрахунку прибутку від здійсненого замовлення.';
$_['help_ecommerce']['revenue_tax']		= 'Вкажіть середній відсоток ваших витрат для розрахунку прибутку з кожного здійсненого замовлення.';
$_['help_ecommerce']['tax']				= 'Розрахунок і передача суми податкового вирахування по здійсненому замовленню в валюті магазину.';
$_['help_ecommerce']['shipping']		= 'Передача вартості доставки по здійсненому замовленню в валюті магазину.';
$_['help_ecommerce']['coupon']			= 'Передає номер купона (промокоду) по якому була нарахована знижка при здійсненні замовлення.';
$_['help_goal']['status']				= 'Збір даних про події (досягнутих відвідувачами цілях) для подальшого розрахунку конверсій в інтернет-магазині.';
$_['help_goal']['label']				= 'Опишіть ціль для більш гнучкою візуалізації подій в звітах і скопіюйте його в налаштування цілей Google Analytics.';
$_['help_goal']['category']				= 'Вкажіть категорію цілі для розбивки подій на логічні групи і скопіюйте її в настройки цілей Google Analytics.';
$_['help_goal']['action']				= 'Придумайте для цілі ідентифікатор і скопіюйте його в налаштування цілей Google Analytics.';
$_['help_goal']['element']				= 'Визначте елемент при події якого буде досягнута ціль у вигляді id або класу. Наприклад: `#cart`, `.cart`, `#product .cart`.';
$_['help_goal']['event']				= 'Вкажіть подію елемента при якої ціль буде досягнута.';
$_['help_goal']['value']				= 'Ви можете передати в Google Analytics цінність цілі цілим числом у валюті магазину!';

// Text
$_['text_module']						= 'Модулі';
$_['text_analytics']   					= 'Аналітика';
$_['text_extension']					= 'Розширення';
$_['text_edit']							= 'Зміна налаштувань модуля';
$_['text_success']						= 'Налаштування модуля оновлені!';
$_['text_title']['counter']				= 'Налаштування лічильника';
$_['text_title']['userCookies']			= 'Cookies відвідувачів';
$_['text_title']['userParams']			= 'Параметри відвідувачів';
$_['text_title']['ecommerce_actions']	= 'Передавати дані при подіях';
$_['text_title']['ecommerce_products']	= 'Дані про товар';
$_['text_title']['ecommerce_purchase']	= 'Дані про покупку';
$_['text_title']['goal_action']			= 'Події JavaScript';
$_['text_seconds']						= 'Секунд';
$_['text_copy_to_clipboard']['action']	= 'Скопіювати ідентифікатор цілі';
$_['text_copy_to_clipboard']['param_id']= 'Скопіювати ідентифікатор параметра';
$_['text_copy_to_clipboard']['param_name']= 'Скопіювати назву параметра';
$_['text_counter']['gtag']				= 'gtag.js';
$_['text_counter']['analytics']			= 'analytics.js';
$_['text_counter']['default']			= 'Звичайний';
$_['text_counter']['asynch']			= 'Асинхронний';
$_['text_goal']['label']				= 'Ярлик цілі';
$_['text_goal']['category']				= 'Категорія цілі';
$_['text_goal']['action']				= 'Дія цілі';
$_['text_goal']['element']				= 'Елемент';
$_['text_goal']['event']				= 'Подія';
$_['text_goal']['value']				= 'Цінність цілі';
$_['text_goal_modal']['title_add']			= 'Додати подію JavaScript';
$_['text_goal_modal']['title_edit']			= 'Редагувати подію JavaScript';
$_['text_goal_modal']['goal_title']			= 'Налаштування цілі';
$_['text_goal_modal']['value_title']	= 'Цінність цілі';
$_['text_goal_event']['mouse']			= 'Події миші';
$_['text_goal_event']['touch']			= 'Події тачпада';
$_['text_goal_event']['keyboard']		= 'Події клавіатури';
$_['text_goal_event']['form']			= 'Події форми';
$_['text_goal_event']['window']			= 'Події вікна';

// Success
$_['success_goal']['add']				= 'Ціль Google Analytics успішно додана!';
$_['success_goal']['edit']				= 'Ціль Google Analytics успішно відредаговано!';
$_['success_goal']['delete']			= 'Ціль Google Analytics успішно видалена!';

// Error
$_['error_counter_id']					= 'Не вірний формат ідентифікатора ресурсу (номера лічильника)!';
$_['error_timing_name']					= 'Назва події повинна містити не менше 3 і не більше 32 символів!';
$_['error_timing_category']				= 'Категорія події повинна містити не менше 3 і не більше 64 символів!';
$_['error_timing_label']				= 'Ярлик події повинен містити не менше 3 і не більше 255 символів!';
$_['error_link_attr_name']				= 'Назва cookie має містити не менше 3 і не більше 32 символів!';
$_['error_link_attr_expires']			= 'Термін дiї cookie не може бути менше 0 секунд!';
$_['error_linker_domains']				= 'Невірний формат домену!';
$_['error_cookie_name']					= 'Назва cookie відвідувачів повинно містити не менше 3 і не більше 32 символів!';
$_['error_cookie_expires']				= 'Термін дії cookie відвідувачів не може бути менше 0 секунд!';
$_['error_cookie_domain']				= 'Невірний формат домену в cookie відвідувачів або сайт не належить домену!';
$_['error_ecommerce_revenue_tax']		= 'Податок/витрати повинен бути не менше 0 і не більше 99!';
$_['error_goal']['action_exists']		= 'Ціль з таким ідентифікатором вже існує!';
$_['error_goal']['action_format']		= 'Ідентифікатор цілі повинен містити тільки символи латиниці і цифри, а замість пробілів використовуйте нижнє підкреслення!';
$_['error_goal']['action_size']			= 'Ідентифікатор цілі повинен містити не менше 3 і не більше 64 символів!';
$_['error_goal']['category']			= 'Категорія цілі повинна містити не більше 64 символів!';
$_['error_goal']['label']				= 'Ярлик цілі повинен містити не більше 255 символів!';
$_['error_goal']['element']				= 'Ідентифікатор елемента повинен містити не менше 2 і не більше 255 символів!';
$_['error_goal']['value']				= 'Цінність мети не може бути менше 0!';
$_['error_permission']					= 'У Вас немає прав для управління цим модулем!';

$_['text_help']					= '<p><b>Google Analytics v1.0 <a href="https://tramplin-studio.store/" target="blank">by Tramplin Studio</a></b> - цей модуль сам створює лічильник і передає дані інтернет-магазину в інструмент веб-аналітики Google, який допомагає отримувати наочні звіти, дії відвідувачів, відстежувати джерела трафіку і оцінювати ефективність реклами. Зібрані лічильником дані обробляються на серверах Google і доповнюються різною інформацією. Але найважливішою можливістю модуля є його здатність дуже просто налаштовувати і передавати <u>дані про досягнуті цілі</u>, <u>дані електронної комерції</u> (eCommerce) і <u>розгорнуті дані про відвідувачів</u>. <u><b>За допомогою цих інструментів ви зможете значно підвищити конверсію вашого інтернет-магазину, що позитивно позначиться на ваших доходах.</b></u></p>
<br>
<p><b>Основні налаштування лічильника.</b></p>
	<p>Робота з модулем починається зі створення лічильника на сайті Google Analytics. Після цього, скопіюйте ідентифікатор ресурсу (номер лічильника) в налаштування модуля і він відразу почне передавати дані як про сами сторінці, так і події, що сталися при взаємодії з ними відвідувачів. В основних налаштуваннях присутні наступні опції:
	<ul>
		<li>Тип лічильника. 2 типу застосовуваного скрипта JS для передачі даних в Google Analytics: `analytics.js` і `gtag.js`.</li>
		<li>Режим роботи лічильника. Різні методи подгрузки JS. Для асинхронного режиму застосовується метод передачі даних `Beacon`.</li>
		<li>Відстеження переглядів сторінок. Може містити додаткові параметри.</li>
		<li>Спостереження за часом користувача для відстеження швидкості завантаження сторінки. Дозволяє скоротити час завантаження сторінок і поліпшити загальне враження від сайту. Може містити додаткові параметри.</li>
		<li>Покращена атрибуція силок. Підвищує точність відстеження кліків, автоматично розрізняючи кліки по силкам з одним і тим же URL на одній сторінці. Може містити додаткові параметри.</li>
		<li>Міждоменне відстеження. Функція зв`язування доменів, яка дозволяє реєструвати відвідування декількох ресурсів як один сеанс. Може містити додаткові параметри.</li>
		<li>Функції для рекламодавців. Дозволяє вимкнути всі функції для рекламодавців, ремаркетингу та звітів про рекламу.</li>
		<li>Передача основної валюти інтернет-магазину.</li>
		<li>Передача основної країни діяльності інтернет-магазину.</li>
		<li>Різні параметри налаштування cookies відвідувачів.</li>
	</ul>
	</p>
	<p><font color="red">Увага!</font> Видаліть звичайний код лічильника з вашого сайту, якщо він вже присутній, щоб уникнути дублювання деяких даних.</p>
	<br>
<p><b>Відправка параметрів відвідувачів.</b></p>
	<p>Цей інструмент може бути корисний для формування звіту на основі даних, отриманих в момент, коли відвідувач знаходиться на сайті. Використовуючи ці дані, можна формувати сегменти для підбору аудиторії в Google Analytics. Дані відвідувачів передаються в Google Analytics як спеціальні параметри `dimensions`. Ви можете налаштувати передачу таких даних:
	<ul>
		<li>ідентифікатор відвідувача може приймати значення: номер сесії або ідентифікатор зареєстрованого користувача в системі OpenCart;</li>
		<li>тип відвідувача: гість або зареєстрований;</li>
		<li>групу покупця, якщо користувач зареєстрований;</li>
		<li>дата реєстрації, якщо користувач зареєстрований;</li>
		<li>статус безпеки аккаунта, який присвоюється зареєстрованому користувачу при модерації;</li>
		<li>статус підписки на розсилку новин, якщо користувач зареєстрований;</li>
		<li>країна зазначена в адресі зареєстрованого користувача за замовчуванням;</li>
		<li>регіон вказаний в адресі зареєстрованого користувача за замовчуванням;</li>
		<li>місто вказаний в адресі зареєстрованого користувача за замовчуванням;</li>
		<li>поштовий індекс вказаний в адресі зареєстрованого користувача за замовчуванням;</li>
		<li>а так же значення додаткових довільних полів зареєстрованих користувачів!</li>
	</ul>
	</p>
	<br>	
<p><b>Відправка даних електронної комерції - eCommerce.</b></p>
	<p>Це інструмент який надає можливість збору та аналізу даних, що відносяться до галузі електронної комерції - eCommerce. Передана інформація відображається на сайті Google Analytics в групі звітів "Електронна комерція".</p>
	<p>Передача даних здійснюється при діях з товаром або набором товарів:
	<ul>
		<li>при перегляді товару в списках (категорії, пошук, виробники, акції, модулі з товарами та інші..);</li>
		<li>при натисканні на товар в списках;</li>
		<li>при перегляді картки (сторінки) товару;</li>
		<li>при додаванні товару в кошик;</li>
		<li>при видаленні товару з кошика;</li>
		<li>при переході до оформлення замовлення;</li>
		<li>при успішному оформленні замовлення.</li>
	</ul>
	Для більш актуальною статистики, так само передаються дані про додавання або видалення, якщо кількість товару в кошику було змінено.<br>
	Увага! Дані про додавання, видалення або замовленні, можуть передаватися не завжди або не бути передано зовсім, у випадку з деякими модулями які замінюють форму оформлення замовлення. Дані електронної комерції успішно передаються при використанні стандартної форми оформлення замовлення OpenCart, при використанні модулів <u>Simple</u> і <u>FastOrder</u>. З іншими модулями робота не гарантується!</p>
	<p>При здійсненні вказаних дій можуть передаватися такі дані:
	<ul>
		<li>виробник товару;</li>
		<li>повна вітка категорій товару, але тільки при перегляді картки (наприклад: "категорія 1/категорія 2");</li>
		<li>список з товарами (категорії, пошук, виробники, акції, модулі з товарами та інші ..), але тільки при натисканні на товар і перегляді в списках;</li>
		<li>позиція товару в списку, якщо значення не дорівнює 0;</li>
		<li>ціна товару, включаючи податкову ставку;</li>
		<li>кількість товару на складі, кількостей при додаванні або видаленні в кошику, і кількість в скоєному замовленні;</li>
		<li>різновид товару, тобто перераховуються обрані опції товару через кому.</li>
	</ul>
	</p>
	<p>При оформленні замовлення можуть так само передаватися і додаткові дані:
	<ul>
		<li>назва магазину вказана в налаштуваннях системи OpenCart;</li>
		<li>дохід від здійсненої покупки (містити додаткові параметри);</li>
		<li>податкове вирахування від здійсненої покупки;</li>
		<li>вартість доставки для здійсненої покупки;</li>
		<li>промокод за яким була нарахована знижка при здійсненні замовлення.</li>
	</ul>
	</p>
	<br>
<p><b>Відправка даних про досягнення цілей.</b></p>
	<p>Ціль - це дія відвідувача, в якої зацікавлений власник сайту: відвідування конкретної сторінки, натискання кнопки, перехід по силці, оплата замовлення і так далі. Коли користувачі приходять на ваш сайт і взаємодіють з ним, Google Analytics збирає інформацію про це і фіксує досягнення цілей. Інформація по цілям в інтерфейсі Google Analytics доступна в звіті "Переходи", а також у всіх стандартних і користувальницьких звітах, побудованих по візитах.</p>
	<p>Модуль дозволяє створювати цілі типу "JavaScript-подія" легко і без втручання в код сайту. Такий тип цілей як "JavaScript-подія" дозволяє відстежувати практично будь-які довільні події на сайті (натискання кнопки, заповнення форми та інші), при виконанні яких не змінюється URL сторінки. Якщо URL змінюється, використовуйте тип цілі "Відвідування сторінок", вони налаштовуються безпосередньо на сайті Google Analytics.</p>
	<p>При створенні цілі вказується її ідентифікатор (дія цілі), елемент на сторінці (при діях з яким ціль буде досягнута) і подія здійснювана з цим елементів (наприклад при натисканні миші).<br>
		Крім обов`язкових, налаштувань цілі можуть містити додаткові параметри:
		<ul>
			<li>Ярлик цілі. Використовується для більш гнучкою візуалізації подій в звітах;</li>
			<li>Категорія цілі. Використовується для розбивки подій на логічні групи;</li>
			<li>Цінність цілі в валюті магазину. Використовується якщо подій приносить або впливає на прибуток.</li>
		</ul>
	</p>
	<p><u>Після установки модуля, вам відразу буде доступно 25 готових цілей</u> і залишиться лише скопіювати їх ідентифікатори в налаштування на сайті Google Analytics. Однак, якщо у вас встановлений нестандартний шаблон або інші модулі які впливають на верстку сайту, то деякі цілі можуть не працювати і їх буде потрібно переналаштувати.</p>
	<br>
<p><b>Корисні поради:</b></p>
	<ul>
		<li>Якщо ви хочете отримувати більш багатосторонні дані про дії відвідувачів вашого інтернет-магазину, тоді радимо встановити інший наш модуль "<u><a href="https://tramplin-studio.store/module/ts-yandex-metrika" target="_blank">TS Yandex Metrika</a></u>". Сервіс Яндекс.Метрика є Російським аналогом Google Analytics і володіє схожим функціоналом. Використовуючи обидва сервісу, ви будете мати можливість порівняти їх звіти, знайти золоту середину, а значить краще зрозуміти своїх клієнтів, знизити рівень витрат і підвищити доходи.</li>
		<li>Так само пропонуємо вашій увазі пакет модулів "<u><a href="https://tramplin-studio.store/module/ts-ab-test-3-in-1" target="_blank">TS AB-Test 3 в 1</a></u>". Це набір простих, але потужних маркетингових інструментів для підвищення ефективності ваших банерів, слайдерів, HTML текстів і будь-яких інших елементів дизайну в OpenCart, за допомогою аналітичного методу "АБ-тестування" (Split test). Завдяки цьому пакету модулів, ви зможете краще донести до відвідувача потрібну інформацію, і тим самим значно підвищите конверсію вашого інтернет-магазину.</li>
	</ul>';

$_['text_author']				= '<p>Якщо у вас виникли питання або пропозиції щодо поліпшення роботи модуля, ви можете з нами зв`язатися:</p>
								<p>Сайт: <a href="https://tramplin-studio.store/" target="_blank">https://tramplin-studio.store/</a><br>
								E-mail: <a href="mailto:info@tramplin-studio.store">info@tramplin-studio.store</a></p>';
?>