<?php
// Heading
$_['heading_title']                    	= 'Массовое редактирование товаров';
$_['heading_license']                   = 'Активация модуля';

// Text
$_['text_module']                       = 'Модули';
$_['text_success']                     	= 'Настройки модуля "Массовое редактирование товаров" успешно обновлены!';
$_['text_success_license']      		= 'Модуль "Массовое редактирование товаров" - успешно активирован!';
$_['text_success_data']                 = 'Настройки успешно обновлены!';
$_['text_license_activate']             = 'Активация модуля "Массовое редактирование товаров"';
$_['text_edit']                        	= 'Настройки модуля';
$_['text_secret_key']              		= 'Подробная инструкция получения данных для активации, дана в статье <a href="http://maxystore.com/license-product-info.html" target="_blanck" class="btn btn-default">Правила покупки лицензионных товаров</a>';
$_['text_license_info'] 				= 'После получения данных для активации, введите в соответствующие поля следующие данные:<br /><ol><li>№ заказа;</li><li>Код товара;</li><li>Ключ активации;</li></ol><br />В случае возникновения вопросов по получению данных для активации, пишите непосредственно на почту:<ol><li>support@maxystore.com</li><li>maxystore.com@gmail.com</li></ol>Помните, что модуль будет работать только на том домене, который вы указали при получении ключа активации!';
$_['text_clipboard']                	= 'Скопировать секретный ключ';
$_['text_mass_update']               	= 'Менеджер товаров';
$_['text_goto_manager']               	= 'Модуль "Массовое редактирование товаров" - успешно установлен! Вы можете перейти в';

// Entry
$_['entry_activation_secret_key']     	= 'Секретный ключ';
$_['entry_order_id']        			= '№ заказа';
$_['entry_product_license_code']    	= 'Код товара';
$_['entry_license_key']        			= 'Ключ активации';

// Tab
$_['tab_info']   						= 'Информация';
$_['tab_license']   					= 'Активация';

// Error
$_['error_permission']                 	= 'Внимание: У Вас недостаточно прав для управления волшебными редакторами!';
$_['error_license']    					= 'Ключ активации не принадлежит этому домену или неверный № заказа, код товара либо секретный ключ!';