<?php
// Heading
$_['heading_title']          = 'OWL Карусель Товаров';

// Text
$_['text_module']            = 'Модули';
$_['add_tab_module']         = 'Модуль';
$_['text_success']           = 'Настройки модуля обновлены!';
$_['text_yes']               = 'Да';
$_['text_no']                = 'Нет';
$_['text_all_product']       = 'Все товары';
$_['text_all_manufacturers'] = 'Все производители';
$_['text_featured']          = 'Выборочные товары';
$_['text_viewed']            = 'Просмотренные товары';
$_['text_hide_module']       = 'Для корректной работы данного источника необходимо выводить модуль на странице карточка товара, и только после на других страницах. Если вам не нужно показывать модуль на странице карточка товара, тогда скройте модуль во вкладке [Дополнительно].';
$_['text_sort_date_added']   = 'Сортировать по дате добавления';
$_['text_sort_rating']       = 'Сортировать по рейтингу';
$_['text_sort_viewed']       = 'Сортировать по популярным';
$_['text_sort_order']        = 'Сортировать по порядку';
$_['text_sort_bestseller']   = 'Только лидеры продаж';
$_['text_sort_special']      = 'Только со скидками';

// Entry
$_['entry_tab_options']      = 'НАСТРОЙКИ';
$_['entry_main']             = 'Основные';
$_['entry_product']          = 'Товары';
$_['entry_additional']       = 'Дополнительно';
$_['entry_display']          = 'Отображение';
$_['entry_title']            = 'Заголовок блока:';
$_['entry_add_block_name']   = 'Название модуля:';
$_['entry_status']           = 'Статус:';
$_['entry_add_class_name']   = 'CSS class для основного блока:';
$_['entry_source']           = 'Источник товаров:';
$_['entry_category']         = 'Товары:';
$_['entry_manufacturer']     = 'Фильтр по производителю:';
$_['entry_sort']             = 'Сортировка и фильтрация:';
$_['entry_image']            = 'Изображение (Ш x В):';
$_['entry_description']      = 'Символов в описание:';
$_['entry_count']            = 'Количество товаров:';
$_['entry_visible']          = 'Товаров при расширение > 1000px:';
$_['entry_visible_1000']     = 'Товаров при расширение < 1000px:';
$_['entry_visible_900']      = 'Товаров при расширение < 901px:';
$_['entry_visible_600']      = 'Товаров при расширение < 600px:';
$_['entry_visible_479']      = 'Товаров при расширение < 480px:';
$_['entry_slide_speed']      = 'Скорость прокрутки (мсек):';
$_['entry_pagination_speed'] = 'Скорость пагинации (мсек):';
$_['entry_rewind_speed']     = 'Скорость обратной прокрутки (мсек):';
$_['entry_autoscroll']       = 'Автопрокрутка (мсек):';
$_['entry_item_prev_next']   = 'Количество прокручиваемых товаров:';
$_['entry_per_page']   		 = 'Постраничная прокрутка товаров?';
$_['entry_random_item']      = 'Случайный вывод товаров?';
$_['entry_show_title']       = 'Показывать заголовок?';
$_['entry_show_name']        = 'Показывать название товара?';
$_['entry_show_desc']        = 'Показывать описание?';
$_['entry_show_price']       = 'Показывать цену?';
$_['entry_show_rate']        = 'Показывать рейтинг?';
$_['entry_show_cart']        = 'Показывать кнопку корзины?';
$_['entry_show_wishlist']	 = 'Показывать кнопку закладки?';
$_['entry_show_compare']	 = 'Показывать кнопку сравнения?';
$_['entry_show_page']        = 'Показывать пагинацию?';
$_['entry_show_nav']         = 'Показывать навигацию?';
$_['entry_show_lazy_load']   = 'Вкл. отложенную загрузку картинок?';
$_['entry_show_mouse_drag']  = 'Вкл. эффект прокрутки мыши?';
$_['entry_show_touch_drag']  = 'Вкл. свайп-жест листание пальцем?';
$_['entry_stop_on_hover']    = 'Останавливать автопрокрутку при наведении?';
$_['entry_show_tabs']        = 'Отображать табами?';
$_['entry_stock'] 			 = 'Выводить товары в наличии?';
$_['entry_current_category'] = 'Привязать текущую категорию?';
$_['entry_current_product']  = 'Учитывать текущий товар?';
$_['entry_hide_module']		 = 'Скрыть модуль?';
$_['entry_use_cache']		 = 'Кешировать модуль?';

// Help
$_['help_category']          = '(Автозаполнение)';
$_['help_count']       	     = 'Максимальное количество товаров в карусели';
$_['help_visible']       	 = 'Количество товаров, отображаемых с самой широкой шириной браузера > 1000px';
$_['help_visible_1000']      = 'Количество товаров, отображаемых с шириной браузера между 1000px и 901px';
$_['help_visible_900']       = 'Количество товаров, отображаемых с шириной браузера между 900px и 601px';
$_['help_visible_600']       = 'Количество товаров, отображаемых с шириной браузера между 600px и 480px';
$_['help_visible_479']       = 'Количество товаров, отображаемых с шириной браузера между 479px и 320px';
$_['help_slide_speed']		 = 'По умолчанию 200';
$_['help_pagination_speed']	 = 'По умолчанию 800';
$_['help_rewind_speed']	 	 = 'По умолчанию 1000';
$_['help_autoscroll']	     = 'Период через который будет срабатывать автопрокрутка.<br/>Оставьте пустым чтобы отключть.';
$_['help_item_prev_next']	 = 'По умолчанию 1';
$_['help_per_page']	 		 = 'Постраничная прокрутка в зависимости от выводимых товаров.';
$_['help_current_category']  = 'Выводить товары на основании текущей категории. Работает только для схемы категории и карточка товара.';
$_['help_current_product']   = 'Текущий товар на странице карточка товара не будет отображен в карусели.';
$_['help_hide_module']       = 'Скрывает модуль на странице карточка товара. Доступно только для источника [Просмотренные товары].';

// Error
$_['error_permission']       = 'У Вас нет прав для управления этим модулем!';
$_['error_name']       		 = 'Укажите название модуля [Вкладка Основные]';
$_['error_title']			 = 'Укажите заголовок [Вкладка Основные]';
$_['error_count']            = 'Пожалуйста заполните поле "Количество товаров" [Вкладка Товары]';
$_['error_image']            = 'Пожалуйста заполните поле "Изображение (Ш х В)" [Вкладке Товары]';
$_['error_description']      = 'Пожалуйста заполните поле "Символов в описание" [Вкладке Товары]';
$_['error_visible']          = 'Пожалуйста заполните поле "Товаров при расширение > 1000px" [Вкладке Товары]';
$_['error_visible_1000']     = 'Пожалуйста заполните поле "Товаров при расширение < 1000px" [Вкладке Товары]';
$_['error_visible_900']      = 'Пожалуйста заполните поле "Товаров при расширение < 901px" [Вкладке Товары]';
$_['error_visible_600']      = 'Пожалуйста заполните поле "Товаров при расширение < 600px" [Вкладке Товары]';
$_['error_visible_479']      = 'Пожалуйста заполните поле "Товаров при расширение < 480px" [Вкладке Товары]';
?>