<?php
// Heading
$_['name_tab_hmp']			= '<b style="color:#007eff;">HYPER PRODUCT MODELS</b>';
$_['heading_titles']		= 'HPM';
$_['heading_title']			= '<b style="color:#4b0082;"><i class="fa fa-sitemap fa-1x fa-rotate-90"></i> HYPER PRODUCT MODELS</b>';
$_['name_kit_series']		= 'Моделі товару';
$_['name_kj_series']		= '<b style="color:#4b0082;"><i class="fa fa-sitemap fa-1x fa-rotate-90"></i> Моделі товару</b>';
$_['name_series']			= 'Тип моделей карточки товару';
$_['add_name_series']		= 'Додати тип моделі товару';
$_['name_kit']				= '<b style="color:#4b0082;"><i class="fa fa-sitemap fa-1x fa-rotate-90"></i> HPM - Моделі товару</b>';
$_['btn_documentation']		= 'Документація';
$_['text_extension']		= 'Модулі';
$_['hpm_version']			= 'Версія модуля';
// First level
$_['title_name']			= 'Заголовок';
$_['title_cat_html']		= 'Заголовок в категоріях<br>Підтримується html';
$_['title_prod_html']		= 'Заголовок в карточці товару<br>Підтримується html';
$_['text_name']				= 'Назва';
$_['text_name_title']		= 'Назва типу моделі товару';
$_['text_comment']			= 'Коментар';
$_['text_edit']				= 'Редактор';
$_['text_enabled']			= 'Включити';
$_['text_disabled']			= 'Виключити';
// Entry
$_['sample_status_title']	= 'Показувати в категоріях*';
$_['entry_sample_title']	= 'Варіант відображення в категоріях';
$_['entry_width']			= 'Зображення';
$_['entry_width_title']		= 'Ширина та висота зображення';
$_['entry_width_lists']		= 'Ширина та висота зображення в категоріях';
$_['entry_lists_title']		= 'Виведення даних моделей у карточки в списках категорій';
$_['entry_ltd']				= 'Ліміт';
$_['entry_ltd_title']		= 'Ліміт варіантів в категорії. Пусто - не обмежувати.';
$_['entry_store']			= 'Мультимагазини<br>Детальніше в HELPER!';

$_['after_that']			= 'After that';
$_['entry_types_column']	= 'Виведення';
$_['entry_column_title']	= 'Виведення поля для відображенні після заголовків блоку';
$_['entry_type']			= 'Тип карточки товару';
$_['entry_type_title']		= 'Налаштування типу карточки товару<br>Детальніше в HELPER!';
$_['group_title']			= 'Приховати дочірні товари в списках<br>Детальніше в HELPER!';
$_['redirect_title']		= '301 редирект на батьківський товар<br>Детальніше в HELPER!';
$_['hash_title']			= 'Хеш # в завершенні url товару<br>Детальніше в HELPER!';
$_['entry_types']			= 'Варіант';
$_['entry_types_title']		= 'Варіант виводу серій, моделей в товарі';
$_['entry_links']			= 'Зв&#39язки';
$_['entry_links_title']		= 'Прив&#39язка типу<br>Детальніше в HELPER!';
$_['entry_titles']			= 'Заголовок серії моделей';
$_['entry_status']			= 'Статус';
$_['entry_status_name']		= 'Назва як<br>заголовок групи моделей';
$_['entry_position']		= 'Позиція';
$_['entry_position_title']	= 'Позиція виведення<br>Детальніше в HELPER!';
$_['insertBefore']			= 'insert Before';
$_['insertAfter']			= 'insert After';
$_['prependTo']				= 'prepend To';
$_['appendTo']				= 'append To';
$_['entry_selector']		= 'Селектор';
$_['entry_selector_title']	= 'ID або CLASS<br>Детальныше в HELPER!';
$_['entry_suppler']			= 'Постачальник';
$_['entry_brand']			= 'Виробник';
$_['entry_category']		= 'Категорыя';
$_['entry_view_title']		= 'Приховувати товар<br>якщо кілкість 0';
$_['hpm_next_title']		= 'Переключати на товар<br>який є в наявності';


$_['col_sku_search']		= 'Пошук за моделлю';
$_['col_name_search']		= 'Пошук за назвою';
$_['add_sku_product']		= 'Введіть модель товару';
$_['add_name_product']		= 'Введіть назву товару';
$_['parent_product']		= 'Батьківський товар';
$_['img_edit']				= 'Зображення товару <br> Клік для заміни';
$_['col_sort']				= 'Сортування';
$_['col_add']				= 'Застосувати';
// Second level
$_['meta_key']			= 'Мета-тег Keywords';
$_['image']				= 'Зображення';
$_['sku']				= 'SKU';
$_['model']				= 'Модель';
$_['attribute']			= 'Атрибут';
$_['price']				= 'Ціна';
$_['ean']				= 'EAN';
$_['upc']				= 'UPC';
$_['jan']				= 'JAN';
$_['isbn']				= 'ISBN';
$_['mpn']				= 'MPN';
$_['location']			= 'Розташування';
$_['col_size']			= 'Розміри (Д x Ш x В)';
$_['col_weight']		= 'Вага';
$_['name']		        = 'Назва';
$_['meta_h1']		    = 'HTML-тег H1';
$_['meta_title']		= 'HTML-тег Title';
$_['meta_keyword']		= 'Мета-тег Keywords';
// Nype Parent
$_['type_unique_con']		= 'Без групування';
$_['type_unique']			= 'Групування';
$_['type_unique_hash']		= 'Групування + #';

// Child TYPE Option
$_['type_images']			= 'Рядами';
$_['type_img_slide']		= 'Сдайдер';
$_['type_img_select']		= 'Список';
// Child TYPE Category
$_['none_sample']			= 'Відключено';
$_['list_sample']			= 'Список';
$_['info_sample']			= 'Кнопка';
$_['table_sample']			= 'Кнопка + таблиця';
$_['slider_sample']			= 'Картинки слайдером';
$_['img_tab_sample']		= 'Картинки слайдером + таблиця';
$_['table_attrs']      		= 'Атрибути';

// Buttons
$_['button_remove']			= 'Видалити';
$_['button_out']			= 'Вийти';
$_['button_save']			= 'Зберегти';
$_['button_cancel']			= 'Закрити';
$_['button_add_remove']		= 'Додати<br>Видалити';
$_['button_on_off']			= 'Статус<br>ON | OFF';
$_['button_apply']			= 'Застосувати';
// Name

$_['kit_settings']			= 'Тип серії комплекту';
$_['hpm_set_category']		= 'Виведення в категоріях';
$_['kit_set_product']		= 'Карточка товару';
$_['hpm_fields_block']		= 'Дані моделей';
$_['kit_fields']			= 'Поле виведення';
$_['kit_fields_title']		= 'Поле для виведення даних<br>до моделей товарів';
$_['kit_column']			= 'Блоки заміни в карточці товару';
$_['kit_column_h']				= 'Заміняти заголовок H1<br>товару - см. helper';
$_['cat_column_h']				= 'Заміняти заголовок на H1<br>товару - см. helper';
$_['kit_column_img']			= 'Заміняти зображення<br>товару - см. helper';
$_['kit_column_info']			= 'Заміняти дані товару:<br>sku, mpn и т.д. - см. helper';
$_['kit_column_desc']			= 'Заміняти опис<br>товару - см. helper';
$_['kit_column_attr']			= 'Заміняти характеристики товару - см. helper';

$_['kit_css']				= 'Користувацький CSS та JS для карточки товару';
$_['kit_css_cat']			= 'Користувацький CSS та JS для категорій';
// Help
$_['help_name']			= 'HELPER';
//'help_name_titles',
$_['help_ok']			= 'Далі';
// Help Product Level
$_['help_name_kit']			= '<b>Моделі товару</b>';
$_['top_kit_text']			= 'Вкладка прив&#39язки товарів до батьківського товару типу моделі карточки товару для виведення їх карточці даного товару. Всі умови
виведення налаштовуються та редагуються безпосередньо в модулі <b>HYPER PRODUCT MODELS</b>. Дивіться підказки хелперів з правого боку кожного блоку налаштувань.';
$_['help_first_kit']		= '<b>ПОШУК та ДОДАВАННЯ/b>';

$_['help_second_kit']		= 'Оберіть найбільш зручний вам спосіб пошуку товару:
<br><b>Пошук за назвою товару</b>
<br><b>Пошук за моделлю товару</b>
<br>* Підібравши необхідний товар підв&#39яжіть натиснувши на товар в випадаючому списку. В такому випадку товар автоматично
додасться після чого обов&#39язково збережіть змінити кнопкою Застосувати
<mark class="btn btn-success btn-xs" data-toggle="tooltip" title="" data-original-title="Застосувати"><i class="fa fa-check-square-o"></i></mark> праворуч.
<br> Також ви можете використовувати модуль <b>АОП</b> - Автоматичної Обробки Прайслистів від розробника usergio, для масового
додавання та прив&#39язки товарів до модуля <b>HYPER PRODUCT MODELS</b>';
$_['help_third_kit']		= '<b>СПИСОК</b>';
$_['help_fourth_kit']		= '<b>ID</b> - id товару<br>
<i class="fa fa-dot-circle-o"></i> - Вибір батьківського товару для зв&#39язки дочірніх товарів <br>
* Батьківський товар є основним, до якого підтягуються дочірні товари для зв&#39язки їх в одну карточку товару
в залежності вд обраного типу моделей карточки товару в налаштуваннях модуля <b>HYPER PRODUCT MODELS</b><br>
<b>SKU</b> - артикул товару<br>
<i class="fa fa-picture-o"></i> - Зображення товару<br>
* Автоматично за замовчуванням підтягується основне зображення товару,<br>
для его заміни клікніть по зображенню та додайте своє, якщо це має сенс.<br>
--<br>
<b>Сортування</b> - Сортування товарів в блоці моделей
';

$_['help_name_hpm']			= '<b>Моделі товарів</b>';
// Help First Level
$_['help_first_kit_series']		= 'Модуль <b>HYPER PRODUCT MODELS</b> дозволяє в одному товарі об&#39єднати та згрупувати однотипні моделі товарів, серії, 
модельний ряд.  AJAX заміна даних карточки товару на дані дочірніх-зв&#39язаних в групу товарів на льоту, без заміни url та без перезавантаження сторінки товару.
<br> Відмінна заміна урізаним за функціоналом опціям.
<br> Дев&#39ять варіантів типу моделей карточки товару.
<br> Збереження повного функціоналу товару.
<br> Можливість приховати дочірні товари в списках. При цьому вони доступні тільки в батьківському товарі, в закладках, в порівнянні та при додаванні їх у кошик.
<br> 301 редирект з дочірніх товарів на батьківський (позбавляємось від зайвих посилань однотипних товарів).
<br> Рейтинг та відгуки прив&#39язані до батьківського товару для всієї групи товарів, що зібрані в модельний ряд, серію товару, тобто отримуємо один блок відгуків до всіх зв&#39язаних однотипних товарів!
<br> Виведення необхідного товару по по хеш # (hash) в завершенні url (чпу) та без.
<br> Підтримує всі ціни, групові знижки, акції, опції, статуси товару, кількість товару, додавання в закладки та у порівняння, тощо.
<br> Якщо у дочірнього товару є акція, тоді його батьківській товар показується на сторінці акцій.
<br> Вибір заміни зображень, даних, описів та характеристик товару на вибір.
<br> Блок всіх моделей товару можна вивести за селектором в любому місці карточки товару на ваш розсуд.
<br> Виведення блоку моделей в ряд, слайдером або списком на вибір.
<br> Підтримка Мультимагазинив.';

$_['help_second_kit_series']	= '<b>СПИСОК ТИПУ МОДЕЛЕЙ ТОВАРІВ</b>';
$_['help_third_kit_series']		= '<b>Назва:</b> - назва та заголовок моделей товару.
<br><b>Коментар:</b> - короткий технічний опис до моделей товару.
<br><b>Редактори</b> - редагування блоку моделей товару.
<br><b>Статус:</b> - показує статус включений чи відключений блок моделей товару.
<br><b>Видалити</b> - видалення типу моделей товару.
<br><b>Додати</b> - додавання типу моделей товару.';
// Help ADD Second Level INFO
$_['help_name_add']			= 'Додавання моделі товару';
$_['top_add_text']			= '<b>Назва:</b> - заповніть це поле та збережіть зміни. Після цього ви зможете перейти безпосередньо
до налаштувань та редагування створеного блоку типу моделей товару на сторінці додавання типу, натиснувши кнопку редагування.
<br>Всі умови виведення налаштовуються та редагуються безпосередньо в модулі <b>HYPER PRODUCT MODELS</b>.
Дивіться підказки хелперів праворуч від кожного блоку налаштувань.';
// Help Second Level INFO
$_['help_first_series']		= 'Вкладка налаштувань виведення типу моделей товару.
<br>Уважно прочитайте всі хелпери перш ніж приступити до налаштувань!';
$_['help_second_series']	= '<b>НАЗВА</b>';
$_['help_third_series']		= '<b>Назва:</b> - Назва типу моделей товару.
<br>Носить суто технічний характер та використовується тільки в адміністративній частині';
$_['help_second_store']	= '<b>МУЛЬТИМАГАЗИНИ</b>';
$_['help_third_store']		= '<b>Мультимагазини:</b> - Якщо ви використовуєте мультимагазини і ви хочете щоб даний тип моделей був привязаний тільки до
одному з магазинів або декільком, то відзначте їх у спливаючому віконці.<br>За замовчуванням відзначені всі!';
$_['help_fourth_series']	= '<b>ТИП КАРТОЧКИ ТОВАРУ</b>';
$_['help_fifth_series']		= 'Три типу карточки товару;
<br><b style="color:rgb(75, 0, 130)">Приховати дочірні товари в списках</b>
<br> - <b style="color:rgb(22, 140, 29)">YES</b> - дочірні моделі товарів приховані в списках та доступні тільки в батьківському товарі, у кошику, в закладках та у порівнянні.
<br> - <b style="color:rgb(0, 0, 0)">NO</b> - дочірні товари не приховані, показуються в списках. Всі зв&#39язані між собою товари також виводяться в карточках товарів з ajax заміною.

<br><b style="color:rgb(75, 0, 130)">301 редирект</b>
<br> - <b style="color:rgb(22, 140, 29)">YES</b> - за прямим посиланням дочірнього товару - 301 редирект на батьківській товар*.
<br> - <b style="color:rgba(0, 0, 0, 0.96)">NO</b> - дочірні моделі товарів доступні за прямим посиланням.
<br>* Приклад при редиректі: За прямим посиланням дочірнього товару - 301 редирект на батьківський товар з AJAX підміною моделі в батьківському товарі на дочірній, з якого прийшли за посиланням.

<br><b style="color:rgb(75, 0, 130)">Хеш # в завершенні url товару</b>
<br> - <b style="color:rgb(22, 140, 29)">YES</b> - дочірні моделі товарів з # (hash) в завершенні url (чпу)*.
<br> - <b style="color:rgb(0, 0, 0)">NO</b> - дочірні моделі товарів без # (hash) в завершенні url (чпу).
<br>* Приклад ЧПУ товарів з # (hash) в завершенні url (чпу): <i style="color:steelblue">domain.com/category/product/#id-red</i> - де при зміні моделі товару <i style="color:steelblue">/#id-red</i> заміняється, наприклад, на <i style="color:steelblue">/#id-black</i>, і т.д.
';

$_['help_sixth_series']		= '<b>ЗВ&#39ЯЗКИ</b>';
$_['help_seventh_series']	= 'Фільтр, прив&#39язка типу моделей для відображення їх в карточках батьківських товарів - в певних постачальниках*** > виробниках > категоріях або у всіх одразу.
<br>Світчер в режимі <b>ALL</b> - тип моделей товару у всіх товарах.
<br>Світчер в режимі <b>EDIT</b> - активує фільтр категорій праворуч.
<br> <b><i class="fa fa-indent"></i></b> - фільтр по категоріям.
<br><b>Постачальник:</b> - оберіть необхідних постачальників, до яких ви бажаєте прив&#39язати даний тип моделей.
<br><b>Виробник:</b> - оберіть необхідних виробників, до яких ви бажаєте прив&#39язати даний тип моделей.
<br><b>Категорії:</b> - оберіть необхідні категорії, до яких ви бажаєте прив&#39язати даний тип моделей.
<br>Ви можете відмітити і постачальників, і виробників, і категорії - з урахуванням товарів, що належать до них, та буде виводитись
тип моделей, якщо до товару підв&#39язані його дочірні товари - у вкладці <b>HYPER PRODUCT MODELS</b> в адмін частині редактору карточки товару.
<br>***при використанні АОП.';
$_['help_eighth_series']	= '<b>ТОВАР НА СКЛАДІ</b>';
$_['help_ninth_series']		= 'Якщо кількість товару, а також кількість його опцій дорівнюють нулю, такий товар буде прихований в блоці типу моделей.';
$_['help_first_next']	= '<b>ПЕРЕКЛЮЧЕННЯ ЗА НАЯВНІСТЮ</b>';
$_['help_second_next']		= 'Якщо кількість товару, а також кількість його опцій дорівнюють нулю, при переході на товар активується модель товару, кількість якого більше нуля.
<br>Кнопки моделей в такому випадку не приховаються, але знебарвляться. Враховується сортування дочірніх товарів. Дивіться вкладку <b>HYPER PRODUCT MODELS</b> в картці товару в адмін частині.';
$_['help_tenth_series']		= '<b>КОМЕНТАР</b>';
$_['help_eleventh_series']	= '<b>Коментар:</b> - Опис, технічні коментарі до даного типу моделей.
<br>Носить суто технічний характер та використовується тільки в адміністративній частині';
$_['help_twelfth_series']	= '<b>СТАТУС</b>';
$_['help_thirteenth_series']	= 'Статус типу моделей; включає та відключає відображення даного типу на сторінках, до яких він підв&#39язаний';
//##############
// Help Second Level TYPE
$_['help_name_lists']		= 'Варіанти моделей в категоріях';

$_['help_on_lists']		= '<b>СТАТУС</b>';
$_['help_on_off_lists']		= '<b>ON | OFF:</b> - Статус блоку в списках (категоріях, тощо) -  включає та відключає відображення блоку там де він під&#39язаний';

$_['help_first_lists']		= '<b>ЗАГОЛОВОК</b>';
$_['help_second_lists']		= '<b>Заголовок:</b> - Назва блоку моделей товару. Виводиться заголовком до блоку моделей на сторінці карточки товару.
<br>Поле дозволяє використовувати HTML.
<br><b>Поле виводу:</b> - дозволяє використовувати одразу за заголовком одне з полів товару до обраної моделі товару.';

$_['help_third_lists']		= '<b>ВАРІАНТ</b>';
$_['help_fourth_lists']		= 'Два варіанта виведення моделей товару;
<br><b>Рядами:</b> - виведення моделей товарів рядами;
<br><b>Список:</b> - виведення групи моделей товару списком - <b style="color:red;">в розробці</b>.';

$_['help_fifth_lists']		= '<b>ЛІМІТ ВИВЕДЕННЯ МОДЕЛЕЙ</b>';
$_['help_sixth_lists']		= 'Поле для вводу ліміту виведення моделей до карточки товару в списках товарів.
<br>Для виведення всіх моделей залиште поле пустим';

$_['help_seventh_lists']		= '<b>ЗАМІНА H1 ТОВАРУ</b>';
$_['help_eighth_lists']	= 'Включає заміну заголовку на Н1 дочірніх товарів';
$_['help_ninth_lists']		= '<b>ЗАМІНА ЗОБРАЖЕНЬ ТОВАРУ</b>';
$_['help_tenth_lists']	= 'Включає заміну зображень товару на зображення дочірнього товару';



$_['helper_list']		= '<b>ПОРАДА</b>';
$_['helper_lists']		= 'Майте на увазі, що при виведенні даних в категорії ви додатково навантажуєте базу даних (далі БД) запитами,
як і у випадку з будь-якими іншими додатковими модулями, які ви виводите на будь-яку сторінку.
<br> В модулі <b>HPM</b> ми намагалися за можливістю скоротити кількість звернень до БД, але до всього іншого існує ще одна причина на користь полегшення карточок товару в списках.
З кінця 2011 року та по теперішній час, спостерігаючи на декількох інтернет-магазинах у вебвізор яндексу за поведінкою користувачів на сторінках інтернет-магазину, ми помітили дуже цікаву картину.
Майже 95-97% користувачів здійснюють всі дії безпосередньо у карточці товару, при цьому ігнорують усілякі кнопочки Купити та подібні в списках товарів - вони просто переходять в карточку товару
і вже там, після детального вивчення інформації та ознайомлення з відгуками про товар - переходять до самої купівлі.
<br>Поміркуйте над цим. Це гарний повід полегшити карточку товару в списках, як то кажуть *кожна частка секунди гривню береже!* :)';
//##############
// Help Second Level TYPE
$_['help_name_type']		= 'Варіант моделей в карточці товару';
$_['help_first_type']		= '<b>ЗАГОЛОВОК</b>';
$_['help_second_type']		= '<b>Заголовок:</b> - Назва блоку моделей товару. Виводиться заголовком до блоку моделей на сторінці карточки товару.
<br>Поле дозволяє використовувати HTML.
<br><b>Поле виведення:</b> -  дозволяє використовувати одразу за заголовком одне з полів товару до обраної моделі товару.
<br><i class="fa fa-dot-circle-o"></i> Включення заголовку до блоку моделей товару.';

$_['help_third_type']		= '<b>ВАРІАНТ</b>';
$_['help_fourth_type']		= 'Три варіанти виведення моделей товару;
<br><b>Рядами:</b> - виведення моделей товарів рядами;
<br><b>Слайдер:</b> - виведення групи моделей товарів в ряд слайдером - <b style="color:red;">в розробці</b>
<br><b>Список:</b> - виведення групи моделей товару списком - <b style="color:red;">в розробці</b>.';

$_['help_seventh_type']		= '<b>ПОЗИЦІЯ</b>';
$_['help_eighth_type']		= 'Вибір позиції відображення до та після якого селектору вставляти блок моделей товару:

<br><b>insert Before</b> - перед блоком тегом;
<br><b>prepend To</b> - всередині на початку;
<br><b>append To</b> - всередині в кінці;
<br><b>insert After</b> - за блоком тегу;';

$_['help_ninth_type']		= '<b>СЕЛЕКТОР</b>';
$_['help_tenth_type']		= 'ID або CLASS блоку до або після якого вставляти блок виведення моделей серії товару.
<br>Підказка: визначте в карточці товару id або class до або після якого ви бажаєте вивести блок вибору моделей товару. Дивіться приклади в демо.';

$_['help_first_column']		= '<b>ЗАМІНА H1 ТОВАРУ</b>';
$_['help_second_column']	= 'Включає заміну заголовку Н1 товару з основного на Н1 дочірнього товару';
$_['help_third_column']		= '<b>ЗАМІНА ЗОБРАЖЕНЬ ТОВАРУ</b>';
$_['help_fourth_column']	= 'Включає заміну зображень товару як основного так і додаткових зображень дочірнього товару';
$_['help_fifth_column']		= '<b>ЗАМІНА ОПИСІВ ТОВАРУ</b>';
$_['help_sixth_column']		= 'Включає заміну опису товару на опис дочірнього товару';
$_['help_seventh_column']	= '<b>ЗАМІНА ХАРАКТЕРИСТИК ТОВАРУ</b>';
$_['help_eighth_column']	= 'Включає заміну характеристики товару на характеристики дочірнього товару ';

// -- Start Column_Modal
$_['help_fifth_type']		= '<b>ПОЛЕ ВИВЕДЕННЯ</b>';
$_['help_sixth_type']		= 'Вибір поля для виведення в блоці до моделей товару
<br><b>OFF:</b> - поле виключене.
<br><b>Зображення:</b> - виводить зображення товару.
<br><b>Ціна:</b> - виводить ціну товару (включаючи акції).
<br><b>Атрибути:</b> - виведення значення атрибута з пошуку (автокомплит).
<br><b>SKU:</b> - виводить дані з поля SKU / Артикул товару.
<br><b>Модель:</b> - виводить дані з поля Модель товару.
<br><b>EAN:</b> - виводить дані з поля EAN товару.
<br><b>UPS:</b> - виводить дані з поля UPS товару.
<br><b>JAN:</b> - виводить дані з поля JAN товару.
<br><b>ISBN:</b> - виводить дані з поля ISBN товару.
<br><b>MPN:</b> - виводить дані з поля MPN товару.
<br><b>Розташування:</b> - виводить дані з поля Location / Розташування товару.
<br><b>Розміри (Д x Ш x В):</b> - виводить дані з поля розмірів товару.
<br><b>Вага:</b> - виводить дані з поля ваги товару.
<br><b>Назва:</b> - виводить дані з поля MPN товару.
<br><b>HTML H1:</b> - виводить дані з поля Мета-тег Keywords товару.
<br><b>Мета-тег Title:</b> - виводить дані з поля Мета-тег Keywords товару.
<br><b>Мета-тег Keywords:</b> - виводить дані з поля Мета-тег Keywords товару.
<br><br><b>Картинка:</b> - розміри зображення за шириною та висотою, якщо воно виведене.';

// Help Second Level CSS & JS
$_['help_name_js']		= 'КАСТОМНИЙ CSS та JS';
$_['help_first_js']		= '<b>CSS</b>';
$_['help_second_js']	= 'Тут ви можете застосувати власні стилі до блоку типу моделі, а також до карточки товару,
наприклад, приховати зайві елементи при виведенні в карточку товару блок моделей.';
$_['help_third_js']		= '<b>JS</b>';
$_['help_fourth_js']	= 'Поле введення js для додаткової адаптації карточки товару з модулем <b>HYPER PRODUCT MODELS</b>.';
// Help Store Level Links
$_['help_name_store']		= 'Мультимагазини';
$_['top_store_text']		= 'Виберіть магазин до якого потрібно привязати висновок типу моделей';
// Help Second Level Links
$_['help_name_links']		= 'Прив&#39язка типу';
$_['top_links_text']		= 'Оберіть категорії для виведення типу моделей в їх товарах';
$_['bottom_links_text']		= 'Намагайтесь забезпечити унікальність вибору таким чином, щоб ваш вибір не збігався з раніше обраними типами!
 Інакше спрацює остання прив&#39язка в останньому створеному типі!';
// Text
$_['bottom_kit_text']		= 'Не заьувайте зберігати зміни, які ви внесли, кнопкою Зберегти, що розташована у правому верхньому куті!';
$_['text_module']			= 'Модулі';
$_['text_success']			= 'Налаштування модуля <b>HYPER PRODUCT MODELS</b> збережені!';

// Authors
$_['desc_author']				= 'Авторскі права';
$_['desc_copy']					= 'Правовласникі';
$_['desc_author_start']			= '<span>A&M © ' . date('Y') . '</span>';
$_['desc_author_copy']			= 'Всі права на дане програмне забезпечення належать його авторам <br>
<a class="author" target="_blank" href="https://opencartforum.com/user/28051-awaro/">AWARO</a>
& <a class="author" target="_blank" href="http://mpn-oc.org/profile/?h='.base64_encode('hyper_product_models||'.str_replace(array('https://','http://'),'',HTTP_CATALOG)).'">mpn2005</a><br><hr>
Окрема подяка<br>
<a class="author" target="_blank" href="https://opencartforum.com/profile/709744-kjlukoo/">kJlukOo</a>
<a class="author" target="_blank" href="https://opencartforum.com/profile/26794-usergio/">usergio</a>
<a class="author" target="_blank" href="https://opencartforum.com/profile/675243-chukcha/">chukcha</a>
<a class="author" target="_blank" href="https://opencartforum.com/profile/678128-spectre/">spectre</a>
<a class="author" target="_blank" href="https://opencartforum.com/profile/711752-paulkravchenko/">PaulKravchenko</a><hr>
Перепродаж даного програмного забезпечення, його привласнення, передача третім особам, викладання в публічний доступ
та інші не санкціоновані дії, що порушують авторські права розробників, заборонені і переслідуються за законом!';
$_['copy_label']				= '<span class="ka-ws"><b>A&M</b><br>Web Systems</span><br>';
// Error
$_['url_module']		= 'Розширення';
$_['error_permission']		= 'Ви не маєте прав для редагування модуля <b>HYPER PRODUCT MODELS</b>!';
$_['error_description']		= 'Опис має містити від 3 до 500 символів';
$_['error_name']			= 'Назва має містити від 3 до 126 символів';
$_['text_save_success']		= 'Товар успішно доданий в блок моделей!';
$_['text_save_error']		= 'Такого товару немає або ви намагаєтесь додати товар який вже доданий в блок моделей!';

// KEY PAGE
$_['desc_name_key']		= '<b>ЗВЕРНІТЬ УВАГУ!</b>
Насамперед уважно прочитайте файл readme.txt!!!
<br>Будь-які питання по модулю - ласкаво просимо до теми тех підтримки, тестуємо, відписуємось, ставимо питання!
<br>Не коректно встановлений модуль, не запрацював, тощо - пишемо в особисті повідомлення з повними доступами на FTP та адмін частину!
<br>Якщо відмовляєте розробнику в доступах для технічної підтримки - значить підтримка вам не потрібна!
<br>Всі адаптації та інші допрацювання платні!';
$_['key_name']		= 'Активація ліцензії';
$_['activation_key_name']		= 'Ліцензійний ключ';
$_['desc_warning_key']			= 'Ліцензійна угода!';
$_['btn_save_key']	= 'Активувати';
$_['name_key']						= 'Вставте сюди номер вашого ліцензійного ключа та активуйте модуль!';
$_['error_key']						= 'УВАГА!!! Для продовження роботи необхідно активувати модуль!';
$_['error_incorrect_key'] = 'УВАГА!!! Введений некоректний ліцензійний ключ!';
$_['text_continue'] = 'Детальніше...';
$_['warning_start_key']		= ' <span style="font-weight: bold;">УВАГА! </span>
Це програмне забезпечення не вільно розповсюджуване!
 Умови використання ліцензії - "одна покупка модуля > на один домен!".
Це означає що ви можете використовувати одну ліцензію тільки для одного домену.
<br> Для підключення додаткових доменів або піддоменів потрібна додаткова купівля ліцензії модуля!
Заборонена передача даного ПЗ третім особам, розповсюдження від свого імені, змінення вихідних файлів модуля без
отримання дозволу автора модуля.<br>
 Перепродаж даного програмного забезпечення, його привласнення, передача третім особам, викладання в публічний доступ
та інші не санкціоновані дії, що порушують авторські права розробників, заборонені і переслідуються за законом!';
// Help KEY
$_['help_text_key']		= 'Номер ліцензійного ключа ключа';
$_['help_second_key']	= '<b style="color:green;">Як отримати ліцензійний ключ</b>';
$_['help_third_key']	= '<span style="color:#035eff;">Для отримання ліцензійного ключа уважно прочитайте файл readme.txt
<br>Дотримуйтесь описаних в ньому вказівок!</span>';
$_['help_ok_key']		= 'Все зрозумів! Дякую!';