<?php
// Heading
$_['heading_title']				= '<b>Google Analytics <a href="https://tramplin-studio.store/" target="blank">by Tramplin Studio</a></b>';

// Buttons
$_['button_save']				= 'Сохранить';
$_['button_cancel']				= 'Отменить';
$_['button_add']				= 'Добавить';
$_['button_edit']				= 'Редактировать';
$_['button_remove']				= 'Удалить';

// Tabs
$_['tab_main_settings']			= 'Основные настройки';
$_['tab_userParams']			= 'Параметры посетителей';
$_['tab_ecommerce']				= 'Электронная коммерция';
$_['tab_goals']					= 'Цели';
$_['tab_help']					= 'Помощь!';

// Entry
$_['entry_status']						= 'Статус';
$_['entry_counter']['counter_id']		= 'Идентификатор ресурса';
$_['entry_counter']['type']				= 'Тип счетчика';
$_['entry_counter']['mode']				= 'Режим работы счетчика';
$_['entry_counter']['pageview']			= 'Отслеживать просмотры страниц';
$_['entry_counter']['pageview_path']	= 'Передавать путь страницы';
$_['entry_counter']['pageview_title']	= 'Передавать заголовок страницы';
$_['entry_counter']['pageview_location']= 'Передавать полный путь страницы';
$_['entry_counter']['timing']			= 'Отслеживать скорость загрузки страницы';
$_['entry_counter']['timing_name']		= 'Название';
$_['entry_counter']['timing_category']	= 'Категория';
$_['entry_counter']['timing_label']		= 'Ярлык';
$_['entry_counter']['link_attr']		= 'Улучшенная атрибуция ссылок';
$_['entry_counter']['link_attr_name']	= 'Название cookie (префикс)';
$_['entry_counter']['link_attr_expires']= 'Срок действия cookie (секунды)';
$_['entry_counter']['linker']			= 'Междоменное отслеживание';
$_['entry_counter']['linker_domains']	= 'Связываемые домены';
$_['entry_counter']['linker_domain']	= 'Домен (пример: example.com)';
$_['entry_counter']['linker_incoming']	= 'Прием параметров связывания';
$_['entry_counter']['ad_features']		= 'Функции для рекламодателей';
$_['entry_counter']['currency']			= 'Основная валюта';
$_['entry_counter']['country']			= 'Основная страна';
$_['entry_counter']['cookie_name']		= 'Название cookie (префикс)';
$_['entry_counter']['cookie_domain']	= 'Конфигурация домена cookie';
$_['entry_counter']['cookie_expires']	= 'Срок действия cookie (секунды)';
$_['entry_counter']['cookie_update']	= 'Обновление cookie';
$_['entry_userParams']['status']		= 'Передавать параметры посетителей';
$_['entry_userParams']['userId']		= 'Идентификатор посетителя';
$_['entry_userParams']['type']			= 'Передавать тип посетителя';
$_['entry_userParams']['group']			= 'Передавать группу посетителя';
$_['entry_userParams']['date_added']	= 'Передавать дату регистрации';
$_['entry_userParams']['safe']			= 'Передавать статус безопасности';
$_['entry_userParams']['newsletter']	= 'Передавать статус подписки на рассылку';
$_['entry_userParams']['country']		= 'Передавать страну';
$_['entry_userParams']['zone']			= 'Передавать регион/область';
$_['entry_userParams']['city']			= 'Передавать город';
$_['entry_userParams']['postcode']		= 'Передавать почтовый индекс';
$_['entry_userParams']['custom_field']	= 'Передавать настраиваемые поля';
$_['entry_ecommerce']['status']			= 'Передавать данные eCommerce';
$_['entry_ecommerce']['view']			= 'При просмотре товара в списках';
$_['entry_ecommerce']['click']			= 'При нажатии на товар';
$_['entry_ecommerce']['detail']			= 'При просмотре страницы товара';
$_['entry_ecommerce']['add']			= 'При добавлении в корзину';
$_['entry_ecommerce']['remove']			= 'При удалении из корзины';
$_['entry_ecommerce']['checkout']		= 'При переходе к оформлению заказа';
$_['entry_ecommerce']['purchase']		= 'После оформлении заказа';
$_['entry_ecommerce']['brand']			= 'Передавать производителя';
$_['entry_ecommerce']['category']		= 'Передавать категории';
$_['entry_ecommerce']['list_name']		= 'Передавать список с товарами';
$_['entry_ecommerce']['position']		= 'Передавать позицию товара в списке';
$_['entry_ecommerce']['price']			= 'Передавать цену';
$_['entry_ecommerce']['quantity']		= 'Передавать количество';
$_['entry_ecommerce']['variant']		= 'Передавать разновидность (опции)';
$_['entry_ecommerce']['affiliation']	= 'Передавать название магазина';
$_['entry_ecommerce']['revenue']		= 'Передавать доход';
$_['entry_ecommerce']['revenue_codes']	= 'Учитывать при расчете дохода';
$_['entry_ecommerce']['revenue_tax']	= 'Учитывать расходы';
$_['entry_ecommerce']['tax']			= 'Передавать налоговый вычет';
$_['entry_ecommerce']['shipping']		= 'Передавать стоимость доставки';
$_['entry_ecommerce']['coupon']			= 'Передавать промокод';
$_['entry_goal']['status']				= 'Передавать данные о достигнутых целях';
$_['entry_goal']['label']				= 'Ярлык цели';
$_['entry_goal']['category']			= 'Категория цели';
$_['entry_goal']['action']				= 'Действие цели';
$_['entry_goal']['element']				= 'Элемент';
$_['entry_goal']['event']				= 'Событие';
$_['entry_goal']['value']				= 'Ценность';

// Help
$_['help_counter']['counter_id']		= 'Скопируйте идентификатор ресурса (номер счетчика) в настройках на сайте Google Analytics.';
$_['help_counter']['type']				= 'Тип применяемого скрипта JS для передачи данных в Google Analytics.';
$_['help_counter']['mode']				= 'Разные методы подгрузки JS. Для асинхронного режима применяется метод передачи данных `Beacon`.';
$_['help_counter']['pageview']			= 'Отслеживание просмотров и передача дополнительных параметров страниц.';
$_['help_counter']['pageview_path']		= 'URL просматриваемой страницы, начинаться с символа косой черты (/).';
$_['help_counter']['pageview_title']	= 'Заголовок просматриваемой страницы.';
$_['help_counter']['pageview_location']	= 'Полный URL просматриваемой страницы.';
$_['help_counter']['timing']			= 'Отслеживание пользовательского времени. Позволяет сократить время загрузки страниц и улучшить общее впечатление от сайта.';
$_['help_counter']['timing_name']		= 'Строка, которая используется для идентификации передаваемой переменной. Пример: `load`.';
$_['help_counter']['timing_category']	= 'Строка, которая используется для разбивки всех переменных пользовательского времени на логические группы. Пример: `JS Dependencies`.';
$_['help_counter']['timing_label']		= 'Строка, которая может использоваться для более гибкой визуализации времени в отчетах. Пример: `Google CDN`.';
$_['help_counter']['link_attr']			= 'Повышает точность отслеживания кликов, автоматически различая клики по ссылкам с одним и тем же URL на одной странице.';
$_['help_counter']['link_attr_name']	= 'Для распознавания ссылок используется файл cookie.';
$_['help_counter']['link_attr_expires']	= 'Максимальная продолжительность хранения файла cookie (в секундах).';
$_['help_counter']['linker']			= 'Функция связывания доменов, которая позволяет регистрировать посещение нескольких ресурсов как один сеанс.';
$_['help_counter']['linker_domains']	= 'Список целевых доменов для связывания. Одно поле - один домен.';
$_['help_counter']['linker_incoming']	= 'Прием параметров связывания от целевых доменов.';
$_['help_counter']['ad_features']		= 'Позволяет отключить все функции для рекламодателей, ремаркетинга и отчетов о рекламе.';
$_['help_counter']['currency']			= 'Передача основной валюты интернет-магазина.';
$_['help_counter']['country']			= 'Передача основной страны деятельности интернет-магазина.';
$_['help_counter']['cookie_name']		= 'Чтобы избежать конфликтов с другими файлами cookie, может потребоваться изменить префикс файла cookie.';
$_['help_counter']['cookie_domain']		= 'Файл cookie может быть записан в разные уровни домена. Например, если сайт расположен по адресу `shop.example.com`, файл cookie можно записать в домен `example.com`.';
$_['help_counter']['cookie_expires']	= 'Срок действия файла cookie обновляется при каждой загрузке страницы: к текущему времени прибавляется значение этого поля. Если указать значение `0`, срок действия файла cookie закончится с завершением текущего сеанса браузера.';
$_['help_counter']['cookie_update']		= 'Если активно, то файлы cookie будут обновляться при каждой загрузке страницы, а срок действия файла cookie будет установлен по самому последнему посещению сайта. Если не активно, то файлы cookie НЕ будут обновляться при каждой загрузке страницы, а срок действия файла cookie будет установлен по первому посещению сайта пользователем.';
$_['help_userParams']['status']			= 'Идентификация посетителей сайта и передача произвольных параметров.';
$_['help_userParams']['userId']			= 'Параметр `userId`. Уникальное значение.';
$_['help_userParams']['type']			= 'Параметр `type`. Значение `Guest` или `Registered`.';
$_['help_userParams']['group']			= 'Параметр `group`. Значения соответствуют названиям настроенных групп покупателей. Только для зарегистрированных пользователей!';
$_['help_userParams']['date_added']		= 'Параметр `date_added`. Значения в формате 0000-00-00. Только для зарегистрированных пользователей!';
$_['help_userParams']['safe']			= 'Параметр `safe`. Значение `true` или `false`. Только для зарегистрированных пользователей!';
$_['help_userParams']['newsletter']		= 'Параметр `newsletter`. Значение `true` или `false`. Только для зарегистрированных пользователей!';
$_['help_userParams']['country']		= 'Параметр `country`. Значение соответствует стране указанной в настройках адреса. Только для зарегистрированных пользователей!';
$_['help_userParams']['zone']			= 'Параметр `zone`. Значение соответствует региону указанному в настройках адреса. Только для зарегистрированных пользователей!';
$_['help_userParams']['city']			= 'Параметр `city`. Значение соответствует городу указанному в настройках адреса. Только для зарегистрированных пользователей!';
$_['help_userParams']['postcode']		= 'Параметр `postcode`. Значение соответствует индексу указанному в настройках адреса. Только для зарегистрированных пользователей!';
$_['help_userParams']['custom_field']	= 'Параметр соответствует названию произвольных полей на латинице. Значения соответствуют указанным в настройках аккаунта. Только для зарегистрированных пользователей!';
$_['help_ecommerce']['status']			= 'Сбор и анализ данных, относящихся к области электронной коммерции — Ecommerce.';
$_['help_ecommerce']['view']			= 'Передача данных совершается при просмотре товара в списках: категория, поиск, производитель, акции, модули с товарами и пр..';
$_['help_ecommerce']['click']			= 'Передача данных совершается при нажатии на товар.';
$_['help_ecommerce']['detail']			= 'Передача данных совершается при просмотре карточки товара.';
$_['help_ecommerce']['add']				= 'Передача данных совершается при добавлении товара в корзину.';
$_['help_ecommerce']['remove']			= 'Передача данных совершается при удалении товара из корзины.';
$_['help_ecommerce']['checkout']		= 'Передача данных совершается при переходе к оформлению покупки.';
$_['help_ecommerce']['purchase']		= 'Передача данных совершается после успешного завершения покупки.';
$_['help_ecommerce']['brand']			= 'Название производителя указанного в настройках товара.';
$_['help_ecommerce']['category']		= 'Полная ветка категорий, например: `категория 1/категория 2`. Передается только при просмотре карточки товара.';
$_['help_ecommerce']['list_name']		= 'Список в котором находился товар при действии `нажатие на товар`. Например: категория, поиск, производитель, акции, модули с товарами и пр.';
$_['help_ecommerce']['position']		= 'Порядок сортировки указанный в настройках товара, если значение не равно 0.';
$_['help_ecommerce']['price']			= 'Цена товара, включая налоговую ставку.';
$_['help_ecommerce']['quantity']		= 'Количество товара на складе, кол-во при добавлении или удалении в корзине, или кол-во в совершенном заказе.';
$_['help_ecommerce']['variant']			= 'Перечисление выбранных опций товара через запятую. Передает во всех случаях, кроме просмотра карточки товара.';
$_['help_ecommerce']['affiliation']		= 'Передача названия магазина указанного в настройках системы OpenCart.';
$_['help_ecommerce']['revenue']			= 'Расчет и передача дохода от каждого совершенного заказа.';
$_['help_ecommerce']['revenue_codes']	= 'Укажите надбавки которые следует учитывать при расчете дохода с совершенного заказа.';
$_['help_ecommerce']['revenue_tax']		= 'Укажите средний процент ваших расходов для расчета дохода с каждого совершенного заказа.';
$_['help_ecommerce']['tax']				= 'Расчет и передача суммы налогового вычета по совершенному заказу в валюте магазина.';
$_['help_ecommerce']['shipping']		= 'Передача стоимости доставки по совершенному заказу в валюте магазина.';
$_['help_ecommerce']['coupon']			= 'Передает номер купона (промокода) по которому была начислена скидка при совершении заказа.';
$_['help_goal']['status']				= 'Сбор данных о событиях (достигнутых посетителями целях) для дальнейшего расчета конверсий в интернет-магазине.';
$_['help_goal']['label']				= 'Опишите цель для более гибкой визуализации событий в отчетах и скопируйте его в настройки целей Google Analytics.';
$_['help_goal']['category']				= 'Укажите категорию цели для разбивки событий на логические группы и скопируйте ее в настройки целей Google Analytics.';
$_['help_goal']['action']				= 'Придумайте для цели идентификатор и скопируйте его в настройки целей Google Analytics.';
$_['help_goal']['element']				= 'Определите элемент при событии которого будет достигнута цель ввиде id или класса. Например: `#cart`, `.cart`, `#product .cart`.';
$_['help_goal']['event']				= 'Укажите событие элемента при котором цель будет достигнута.';
$_['help_goal']['value']				= 'Вы можете передать в Google Analytics ценность цели целым числом в валюте магазина!';

// Text
$_['text_module']						= 'Модули';
$_['text_analytics']   					= 'Аналитика';
$_['text_extension']					= 'Расширения';
$_['text_edit']							= 'Изменение настроек модуля';
$_['text_success']						= 'Настройки модуля обновлены!';
$_['text_title']['counter']				= 'Настройка счетчика';
$_['text_title']['userCookies']			= 'Cookies посетителей';
$_['text_title']['userParams']			= 'Параметры посетителей';
$_['text_title']['ecommerce_actions']	= 'Передавать данные при действиях';
$_['text_title']['ecommerce_products']	= 'Данные о товаре';
$_['text_title']['ecommerce_purchase']	= 'Данные о покупке';
$_['text_title']['goal_action']			= 'Cобытия JavaScript';
$_['text_seconds']						= 'Секунд';
$_['text_copy_to_clipboard']['action']	= 'Скопировать идентификатор цели';
$_['text_copy_to_clipboard']['param_id']= 'Скопировать идентификатор параметра';
$_['text_copy_to_clipboard']['param_name']= 'Скопировать название параметра';
$_['text_counter']['gtag']				= 'gtag.js';
$_['text_counter']['analytics']			= 'analytics.js';
$_['text_counter']['default']			= 'Обычный';
$_['text_counter']['asynch']			= 'Асинхронный';
$_['text_goal']['label']				= 'Ярлык цели';
$_['text_goal']['category']				= 'Категория цели';
$_['text_goal']['action']				= 'Действие цели';
$_['text_goal']['element']				= 'Элемент';
$_['text_goal']['event']				= 'Событие';
$_['text_goal']['value']				= 'Ценность цели';
$_['text_goal_modal']['title_add']			= 'Добавить событие JavaScript';
$_['text_goal_modal']['title_edit']			= 'Редактировать событие JavaScript';
$_['text_goal_modal']['goal_title']			= 'Настройка цели';
$_['text_goal_modal']['value_title']	= 'Ценность цели';
$_['text_goal_event']['mouse']			= 'События мыши';
$_['text_goal_event']['touch']			= 'События тачпада';
$_['text_goal_event']['keyboard']		= 'События клавиатуры';
$_['text_goal_event']['form']			= 'События формы';
$_['text_goal_event']['window']			= 'События окна';

// Success
$_['success_goal']['add']				= 'Цель Google Analytics успешно добавлена!';
$_['success_goal']['edit']				= 'Цель Google Analytics успешно отредактирована!';
$_['success_goal']['delete']			= 'Цель Google Analytics успешно удалена!';

// Error
$_['error_counter_id']					= 'Неверный формат идентификатора ресурса (номера счетчика)!';
$_['error_timing_name']					= 'Название события должно содержать не менее 3 и не более 32 символов!';
$_['error_timing_category']				= 'Категория события должна содержать не менее 3 и не более 64 символов!';
$_['error_timing_label']				= 'Ярлык события должен содержать не менее 3 и не более 255 символов!';
$_['error_link_attr_name']				= 'Название cookie должно содержать не менее 3 и не более 32 символов!';
$_['error_link_attr_expires']			= 'Срок действия cookie не может быть менее 0 секунд!';
$_['error_linker_domains']				= 'Неверный формат домена!';
$_['error_cookie_name']					= 'Название cookie посетителей должно содержать не менее 3 и не более 32 символов!';
$_['error_cookie_expires']				= 'Срок действия cookie посетителей не может быть менее 0 секунд!';
$_['error_cookie_domain']				= 'Неверный формат домена в cookie посетителей или сайт не принадлежит домену!';
$_['error_ecommerce_revenue_tax']		= 'Налог/расходы должен быть не менее 0 и не более 99!';
$_['error_goal']['action_exists']		= 'Цель с таким идентификатором уже существует!';
$_['error_goal']['action_format']		= 'Идентификатор цели должен содержать только символы латиницы и цифры, а вместо пробелов используйте нижнее подчеркивание!';
$_['error_goal']['action_size']			= 'Идентификатор цели должен содержать не менее 3 и не более 64 символов!';
$_['error_goal']['category']			= 'Категория цели должна содержать не более 64 символов!';
$_['error_goal']['label']				= 'Ярлык цели должен содержать не более 255 символов!';
$_['error_goal']['element']				= 'Идентификатор элемента должен содержать не менее 2 и не более 255 символов!';
$_['error_goal']['value']				= 'Ценность цели не может быть менее 0!';
$_['error_permission']					= 'У Вас нет прав для управления этим модулем!';

$_['text_help']					= '<p><b>Google Analytics v1.0 <a href="https://tramplin-studio.store/" target="blank">by Tramplin Studio</a></b> - этот модуль сам создает счетчик и передает данные интернет-магазина в инструмент веб-аналитики Google, который помогает получать наглядные отчеты, действий посетителей, отслеживать источники трафика и оценивать эффективность рекламы. Собираемые счетчиком данные обрабатываются на серверах Google и дополняются различной информацией. Но самой важной возможностью модуля является его способность очень просто настраивать и передавать <u>данные о достигнутых целях</u>, <u>данные электронной коммерции</u> (eCommerce) и <u>развернутые данные о посетителях</u>. <u><b>С помощью этих инструментов вы сможете значительно повысить конверсию вашего интернет-магазина, что положительно скажется на ваших доходах.</b></u></p>
<br>
<p><b>Основные настройки счетчика.</b></p>
	<p>Работа с модулем начинается с создания счетчика на сайте Google Analytics. После этого, скопируйте идентификатор ресурса (номер счетчика) в настройки модуля и он сразу начнет передавать данные как о самих страницах, так и событиях, произошедших при взаимодействии с ними посетителей. В основных настройках присутствуют следующие опции:
	<ul>
		<li>Тип счетчика. 2 типа применяемого скрипта JS для передачи данных в Google Analytics: `analytics.js` и `gtag.js`.</li>
		<li>Режим работы счетчика. Разные методы подгрузки JS. Для асинхронного режима применяется метод передачи данных `Beacon`.</li>
		<li>Отслеживание просмотров страниц. Может содержать дополнительные параметры.</li>
		<li>Наблюдение за пользовательским временем для отслеживания скорости загрузки страницы. Позволяет сократить время загрузки страниц и улучшить общее впечатление от сайта. Может содержать дополнительные параметры.</li>
		<li>Улучшенная атрибуция ссылок. Повышает точность отслеживания кликов, автоматически различая клики по ссылкам с одним и тем же URL на одной странице. Может содержать дополнительные параметры.</li>
		<li>Междоменное отслеживание. Функция связывания доменов, которая позволяет регистрировать посещение нескольких ресурсов как один сеанс. Может содержать дополнительные параметры.</li>
		<li>Функции для рекламодателей. Позволяет отключить все функции для рекламодателей, ремаркетинга и отчетов о рекламе.</li>
		<li>Передача основной валюты интернет-магазина.</li>
		<li>Передача основной страны деятельности интернет-магазина.</li>
		<li>Различные параметры настройки cookies посетителей.</li>
	</ul>
	</p>
	<p><font color="red">Внимание!</font> Удалите обычный код счетчика с вашего сайта, если он уже присутствует, чтобы избежать дублирования некоторых данных.</p>
	<br>
<p><b>Отправка параметров посетителей.</b></p>
	<p>Этот инструмент может быть полезен для формирования отчета на основе данных, полученных в момент, когда посетитель находится на сайте. Используя эти данные, можно формировать сегменты для подбора аудитории в Google Analytics. Данные посетителей передаются в Google Analytics как специальные параметры `dimensions`. Вы можете настроить передачу следующих данных:
	<ul>
		<li>идентификатор посетителя может принимать значения: номер сессии или идентификатор зарегистрированного пользователя в системе OpenCart;</li>
		<li>тип посетителя: гость или зарегистрированный;</li>
		<li>группу покупателя, если пользователь зарегистрирован;</li>
		<li>дата регистрации, если пользователь зарегистрирован;</li>
		<li>статус безопасности аккаунта, который присваивается зарегистрированному пользователю при модерации;</li>
		<li>статус подписки на рассылку новостей, если пользователь зарегистрирован;</li>
		<li>страна указанная в адресе зарегистрированного пользователя по умолчанию;</li>
		<li>регион указанный в адресе зарегистрированного пользователя по умолчанию;</li>
		<li>город указанный в адресе зарегистрированного пользователя по умолчанию;</li>
		<li>почтовый индекс указанный в адресе зарегистрированного пользователя по умолчанию;</li>
		<li>а так же значения дополнительных настраиваемых полей зарегистрированных пользователей!</li>
	</ul>
	</p>
	<br>	
<p><b>Отправка данных электронной коммерции - eCommerce.</b></p>
	<p>Это инструмент который предоставляет возможность сбора и анализа данных, относящихся к области электронной коммерции - eCommerce. Переданная информация отображается на сайте Google Analytics в группе отчетов "Электронная коммерция".</p>
	<p>Передача данных осуществляется при действиях произведенных с товаром или набором товаров:
	<ul>
		<li>при просмотре товара в списках (категории, поиск, производители, акции, модули с товарами и прочие..);</li>
		<li>при нажатии на товар в списках;</li>
		<li>при просмотре карточки (страницы) товара;</li>
		<li>при добавлении товара в корзину;</li>
		<li>при удалении товара из корзины;</li>
		<li>при переходе к оформлению заказа;</li>
		<li>при успешном оформлении заказа.</li>
	</ul>
	Для более актуальной статистики, так же передаются данные о добавлении или удалении, если количество товара в корзине было изменено.<br>
	Внимание! Данные о добавлении, удалении или заказе, могут передаваться не всегда или не передаваться вовсе, в случае с некоторыми модулями заменяющими форму оформления заказа. Данные электронной коммерции успешно передаются при использовании стандартной формы оформления заказа OpenCart, при использовании модулей <u>Simple</u> и <u>FastOrder</u>. С другими модулями работа не гарантируется!</p>
	<p>При осуществлении перечисленных действий могут передаваться следующие данные:
	<ul>
		<li>производитель товара;</li>
		<li>полная ветка категорий товара, но только при просмотре карточки (например: "категория 1/категория 2");</li>
		<li>список с товарами (категории, поиск, производители, акции, модули с товарами и прочие..), но только при нажатии на товар и просмотре в списках;</li>
		<li>позиция товара в списке, если значение не равно 0;</li>
		<li>цена товара, включая налоговую ставку;</li>
		<li>количество товара на складе, кол-во при добавлении или удалении в корзине, и кол-во в совершенном заказе;</li>
		<li>разновидность товара, то есть перечисляются выбранных опций товара через запятую.</li>
	</ul>
	</p>
	<p>При оформлении заказа могут так же передаваться и дополнительные данные:
	<ul>
		<li>название магазина указанное в настройках системы OpenCart;</li>
		<li>доход от осуществленной покупки (содержит дополнительные параметры);</li>
		<li>налоговый вычет от осуществленной покупки;</li>
		<li>стоимость доставки для осуществленной покупки;</li>
		<li>промокод по которому была начислена скидка при совершении заказа.</li>
	</ul>
	</p>
	<br>
<p><b>Отправка данных о достижении целей.</b></p>
	<p>Цель — это действие посетителя, в котором заинтересован владелец сайта: посещение конкретной страницы, нажатие кнопки, переход по ссылке, оплата заказа и т. д. Когда пользователи приходят на ваш сайт и взаимодействуют с ним, Google Analytics собирает информацию об этом и фиксирует достижение целей. Информация по целям в интерфейсе Google Analytics доступна в отчете "Конверсии", а также во всех стандартных и пользовательских отчетах, построенных по визитам.</p>
	<p>Модуль позволяет создавать цели типа "JavaScript-событие" легко и без вмешательства в код сайта. Такой тип целей как "JavaScript-событие" позволяет отслеживать практически любые произвольные события на сайте (нажатие кнопки, заполнение формы и пр.), при выполнении которых не меняется URL страницы. Если URL меняется, используйте тип цели "Посещение страниц", они настраиваются непосредственно на сайте Google Analytics.</p>
	<p>При создании цели указывается ее идентификатор (действие цели), элемент на странице (при действиях с которым цель будет достигнута) и событие осуществляемое с этим элементов (например по клику мыши).<br>
		Кроме обязательных, настройки цели могут содержать дополнительные параметры:
		<ul>
			<li>Ярлык цели. Используется для более гибкой визуализации событий в отчетах;</li>
			<li>Категория цели. Используется для разбивки событий на логические группы;</li>
			<li>Ценность цели в валюте магазина. Используется если цель приносит или влияет на прибыль.</li>
		</ul>
	</p>
	<p><u>После установки модуля, вам сразу будет доступно 25 готовых целей</u> и останется лишь скопировать их идентификаторы в настройки на сайте Google Analytics. Однако, если у вас установлен нестандартный шаблон или другие модули влияющие на верстку сайта, то некоторые цели могут не работать и потребуют перенастройки.</p>
	<br>
<p><b>Полезные советы:</b></p>
	<ul>
		<li>Если вы хотите получать более многосторонние данные о действиях посетителей вашего интернет-магазина, тогда советуем установить другой наш модуль "<u><a href="https://tramplin-studio.store/module/ts-yandex-metrika" target="_blank">TS Yandex Metrika</a></u>". Сервис Яндекс.Метрика является Российским аналогом Google Analytics и обладает похожим функционалом. Используя оба сервиса, вы будете иметь возможность сравнить их отчеты, найти золоту середину, а значит лучше понять своих клиентов, снизить уровень расходов и повысить доходы.</li>
		<li>Так же предлагаем вашему вниманию пакет модулей "<u><a href="https://tramplin-studio.store/module/ts-ab-test-3-in-1" target="_blank">TS AB-Test 3 в 1</a></u>". Это набор простых, но мощных маркетинговых инструментов для повышения эффективности ваших баннеров, слайдеров, HTML текстов и любых других элементов дизайна в OpenCart, с помощью аналитического метода "АБ-тестирование" (Split test). Благодаря этому пакету модулей, вы сможете лучше донести до посетителя нужную информацию, и тем самым значительно повысите конверсию вашего интернет-магазина.</li>
	</ul>';

$_['text_author']				= '<p>Если у вас возникли вопросы или предложения по улучшению работы модуля, вы можете с нами связаться:</p>
								<p>Сайт: <a href="https://tramplin-studio.store/" target="_blank">https://tramplin-studio.store/</a><br>
								E-mail: <a href="mailto:info@tramplin-studio.store">info@tramplin-studio.store</a></p>';
?>