<?php
// Heading
$_['heading_title']                = 'Авторизация';

// Text
$_['text_account']				          = 'Личный кабинет';
$_['text_login']                   = 'Вход';
$_['text_new_customer']            = 'Новый пользователь';
$_['text_register']                = 'Регистрация';
$_['text_register_account']        = 'Создание учетной записи поможет делать следующие покупки быстрее (не надо будет снова вводить адрес и контактную информацию), видеть состояние заказа, а также видеть заказы, сделанные ранее. Вы также сможете накапливать при покупках призовые баллы (на них тоже можно что-то купить), а постоянным покупателям мы предлагаем систему скидок.';
$_['text_returning_customer']      = 'Я уже зарегистрирован';
$_['text_where_number_send']      = 'SMS с кодом отправлено на номер <span>%s</span>';
$_['text_restore_code']           = 'Отправить код повторно';

// button
$_['button_login']           			 = 'Вход';
$_['button_send_sms']              = 'Далее';
$_['button_register']              = 'Зарегистрироваться';

$_['text_i_am_returning_customer'] = 'Личный кабинет';
$_['text_forgotten']               = 'Забыли пароль?';
$_['text_from']               		 = 'SZ';
$_['text_message']               	 = 'Vash parol %s';
$_['text_specify_code']            = 'Код из sms';

// Entry
$_['entry_email']                  = 'E-Mail:';
$_['entry_telephone']              = 'Чтобы авторизироваться укажите свой номер телефон';
$_['entry_telephone_placeholder']  = '+38(___) ___-__-__';
$_['entry_password']               = 'Пароль:';
$_['entry_name']                   = 'Введите Ваше имя';

// Error
$_['error_login']                  = 'Неправильно заполнены поля E-Mail и/или пароль!';
$_['error_attempts']               = 'Внимание: Вы превысили допустимое количество попыток входа в систему. Пожалуйста, попробуйте через час.';
$_['error_approved']               = 'Необходимо подтвердить аккаунт перед авторизацией.';
$_['error_telephone']              = 'Телефон обязательное поле!';
$_['error_telephone_format']       = 'Вы ввели неверный формат номера!';
$_['error_firstname']       			 = 'Имя обязательно к заполнению!';
$_['error_code']       						 = 'Код должен быть не менее 4-х символов!';
$_['error_code_verify']       		 = 'Неверный код подтверждения!';
$_['error_time_verify']       		 = 'Дождитесь пока придет смс или повторите попытку по истечению 2-х минут';
$_['error_sms']       		 				 = 'Ошибка отправки смс, неверный телефон';
$_['error_sms_setting']       		 = 'Ошибка получения настроек смс';
