<?php
// Heading
$_['heading_title'] = 'Авторизація';

// Text
$_['text_account'] = 'Особистий Кабінет';
$_['text_login'] = 'Вхід';
$_['text_new_customer'] = 'Новий клієнт';
$_['text_register'] = 'Реєстрація';
$_['text_register_account'] = 'Створення облікового запису допоможе купувати швидше. Ви зможете контролювати стан замовлення, а також переглядати замовлення зроблені раніше. Ви зможете накопичувати призові бали і отримувати знижкові купони. <BR>А постійним покупцям ми пропонуємо гнучку систему знижок і персональне обслуговування.<BR>';
$_['text_returning_customer'] = 'Зареєстрований клієнт';
$_['text_i_am_returning_customer'] = 'Увійти в Особистий Кабінет';
$_['text_forgotten'] = 'Забули пароль?';
$_['text_from']               		 = 'SZ';
$_['text_message']               	 = 'Vash parol %s';
$_['text_where_number_send']      = 'SMS з кодом відправлено на номер <span>%s</span>';
$_['text_specify_code']            = 'Код з sms';
$_['text_restore_code']           = 'Відправити код повторно';

// Buttons
$_['button_login']           			 = 'Вхід';
$_['button_send_sms']              = 'Далі';
$_['button_register']              = 'Зареєструватися';

// Entry
$_['entry_email']                  = 'E-Mail:';
$_['entry_telephone']              = 'Щоб авторизуватися вкажіть свій номер телефону';
$_['entry_telephone_placeholder']  = '+38(___) ___-__-__';
$_['entry_password']               = 'Пароль:';
$_['entry_name']                   = "Введіть Ваше ім'я";

// Error
$_['error_login'] = 'Неправильно заповнені поля E-Mail і/або пароль!';
$_['error_attempts'] = 'Ви перевищили максимальна кількість спроб авторизації. Повторіть спробу авторизації на сайті через 1 годину';
$_['error_approved'] = 'Необхідно підтвердити акаунт перед авторизацією.';
$_['error_telephone']              = 'Телефон обов\'язкове поле!';
$_['error_telephone_format']       = 'Вы ввели невірний формат номеру!';
$_['error_firstname']       			 = 'Ім\'я обов\'язково до заповнення!';
$_['error_code']       						 = 'Код повинен буьт не менше 4-х символов!';
$_['error_code_verify']       		 = 'Невірний код підтвердження!';
$_['error_time_verify']       		 = 'Дочекайтесь поки прийде смс або повторіть спробу через декілка хвилин';
$_['error_sms']       		 				 = 'Помилка відправки смс, невірний телефон';
$_['error_sms_setting']       		 = 'Помилка отримання налаштувань смс';
$_['text_enter_as'] = 'Увійти як користувач';
