<?php
// Heading
$_['before_heading_title'] = 'Ой!';
$_['heading_title'] = 'Сторінку не знайдено або недоступна';
$_['text_home']          = 'Головна';
$_['text_catalog'] = 'Каталог';
$_['text_contact']      = 'Контакти';
$_['text_pickup']      = 'Самовивіз';

// Text
$_['text_error'] = 'На жаль, запитувана Вами сторінка не знайдена. Ймовірно, Ви вказали неіснуючу адресу, сторінка була вилучена, переміщена або зараз вона тимчасово недоступна!';
$_['text_useful_links']    = 'Ось кілька корисних посилань:';
